/* automatically generated by rust-bindgen 0.55.1 */

pub const CLOCK_BASE: u32 = 1610637312;
pub const CLK_RST_CONTROLLER_CLK_SOURCE_EMC: u32 = 412;
pub type s32 = cty::c_int;
pub type u32_ = cty::c_uint;
pub type bool_ = cty::c_int;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct burst_regs_t {
    pub emc_rc_idx: u32_,
    pub emc_rfc_idx: u32_,
    pub emc_rfcpb_idx: u32_,
    pub emc_refctrl2_idx: u32_,
    pub emc_rfc_slr_idx: u32_,
    pub emc_ras_idx: u32_,
    pub emc_rp_idx: u32_,
    pub emc_r2w_idx: u32_,
    pub emc_w2r_idx: u32_,
    pub emc_r2p_idx: u32_,
    pub emc_w2p_idx: u32_,
    pub emc_r2r_idx: u32_,
    pub emc_tppd_idx: u32_,
    pub emc_ccdmw_idx: u32_,
    pub emc_rd_rcd_idx: u32_,
    pub emc_wr_rcd_idx: u32_,
    pub emc_rrd_idx: u32_,
    pub emc_rext_idx: u32_,
    pub emc_wext_idx: u32_,
    pub emc_wdv_chk_idx: u32_,
    pub emc_wdv_idx: u32_,
    pub emc_wsv_idx: u32_,
    pub emc_wev_idx: u32_,
    pub emc_wdv_mask_idx: u32_,
    pub emc_ws_duration_idx: u32_,
    pub emc_we_duration_idx: u32_,
    pub emc_quse_idx: u32_,
    pub emc_quse_width_idx: u32_,
    pub emc_ibdly_idx: u32_,
    pub emc_obdly_idx: u32_,
    pub emc_einput_idx: u32_,
    pub emc_mrw6_idx: u32_,
    pub emc_einput_duration_idx: u32_,
    pub emc_puterm_extra_idx: u32_,
    pub emc_puterm_width_idx: u32_,
    pub emc_qrst_idx: u32_,
    pub emc_qsafe_idx: u32_,
    pub emc_rdv_idx: u32_,
    pub emc_rdv_mask_idx: u32_,
    pub emc_rdv_early_idx: u32_,

    pub emc_dqs_brlshft_1_idx: u32_,
    pub emc_cmd_brlshft_2_idx: u32_,
    pub emc_cmd_brlshft_3_idx: u32_,
    pub emc_pmacro_pad_cfg_ctrl_idx: u32_,
    pub emc_pmacro_data_pad_rx_ctrl_idx: u32_,
    pub emc_pmacro_cmd_pad_rx_ctrl_idx: u32_,
    pub emc_pmacro_data_rx_term_mode_idx: u32_,
    pub emc_pmacro_cmd_rx_term_mode_idx: u32_,
    pub emc_pmacro_cmd_pad_tx_ctrl_idx: u32_,
    pub emc_pmacro_data_pad_tx_ctrl_idx: u32_,
    pub emc_pmacro_common_pad_tx_ctrl_idx: u32_,
    pub emc_pmacro_vttgen_ctrl_0_idx: u32_,
    pub emc_pmacro_vttgen_ctrl_1_idx: u32_,
    pub emc_pmacro_vttgen_ctrl_2_idx: u32_,
    pub emc_pmacro_brick_ctrl_rfu1_idx: u32_,
    pub emc_pmacro_cmd_brick_ctrl_fdpd_idx: u32_,
    pub emc_pmacro_brick_ctrl_rfu2_idx: u32_,
    pub emc_pmacro_data_brick_ctrl_fdpd_idx: u32_,
    pub emc_pmacro_bg_bias_ctrl_0_idx: u32_,
    pub emc_cfg_3_idx: u32_,
    pub emc_pmacro_tx_pwrd_0_idx: u32_,
    pub emc_pmacro_tx_pwrd_1_idx: u32_,
    pub emc_pmacro_tx_pwrd_2_idx: u32_,
    pub emc_pmacro_tx_pwrd_3_idx: u32_,
    pub emc_pmacro_tx_pwrd_4_idx: u32_,
    pub emc_pmacro_tx_pwrd_5_idx: u32_,
    pub emc_config_sample_delay_idx: u32_,
    pub emc_pmacro_tx_sel_clk_src_0_idx: u32_,
    pub emc_pmacro_tx_sel_clk_src_1_idx: u32_,
    pub emc_pmacro_tx_sel_clk_src_2_idx: u32_,
    pub emc_pmacro_tx_sel_clk_src_3_idx: u32_,
    pub emc_pmacro_tx_sel_clk_src_4_idx: u32_,
    pub emc_pmacro_tx_sel_clk_src_5_idx: u32_,
    pub emc_pmacro_ddll_bypass_idx: u32_,
    pub emc_pmacro_ddll_pwrd_0_idx: u32_,
    pub emc_pmacro_ddll_pwrd_1_idx: u32_,
    pub emc_pmacro_ddll_pwrd_2_idx: u32_,
    pub emc_pmacro_cmd_ctrl_0_idx: u32_,
    pub emc_pmacro_cmd_ctrl_1_idx: u32_,
    pub emc_pmacro_cmd_ctrl_2_idx: u32_,
    pub emc_tr_timing_0_idx: u32_,
    pub emc_tr_dvfs_idx: u32_,
    pub emc_tr_ctrl_1_idx: u32_,
    pub emc_tr_rdv_idx: u32_,
    pub emc_tr_qpop_idx: u32_,
    pub emc_tr_rdv_mask_idx: u32_,
    pub emc_mrw14_idx: u32_,
    pub emc_tr_qsafe_idx: u32_,
    pub emc_tr_qrst_idx: u32_,
    pub emc_training_ctrl_idx: u32_,
    pub emc_training_settle_idx: u32_,
    pub emc_training_vref_settle_idx: u32_,
    pub emc_training_ca_fine_ctrl_idx: u32_,
    pub emc_training_ca_ctrl_misc_idx: u32_,
    pub emc_training_ca_ctrl_misc1_idx: u32_,
    pub emc_training_ca_vref_ctrl_idx: u32_,
    pub emc_training_quse_cors_ctrl_idx: u32_,
    pub emc_training_quse_fine_ctrl_idx: u32_,
    pub emc_training_quse_ctrl_misc_idx: u32_,
    pub emc_training_quse_vref_ctrl_idx: u32_,
    pub emc_training_read_fine_ctrl_idx: u32_,
    pub emc_training_read_ctrl_misc_idx: u32_,
    pub emc_training_read_vref_ctrl_idx: u32_,
    pub emc_training_write_fine_ctrl_idx: u32_,
    pub emc_training_write_ctrl_misc_idx: u32_,
    pub emc_training_write_vref_ctrl_idx: u32_,
    pub emc_training_mpc_idx: u32_,
    pub emc_mrw15_idx: u32_,
}
#[test]
fn bindgen_test_layout_burst_regs_t() {
    assert_eq!(
        ::core::mem::size_of::<burst_regs_t>(),
        884usize,
        concat!("Size of: ", stringify!(burst_regs_t))
    );
    assert_eq!(
        ::core::mem::align_of::<burst_regs_t>(),
        4usize,
        concat!("Alignment of ", stringify!(burst_regs_t))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<burst_regs_t>())).emc_rc_idx as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(burst_regs_t),
            "::",
            stringify!(emc_rc_idx)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<burst_regs_t>())).emc_rfc_idx as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(burst_regs_t),
            "::",
            stringify!(emc_rfc_idx)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<burst_regs_t>())).emc_rfcpb_idx as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(burst_regs_t),
            "::",
            stringify!(emc_rfcpb_idx)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<burst_regs_t>())).emc_refctrl2_idx as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(burst_regs_t),
            "::",
            stringify!(emc_refctrl2_idx)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<burst_regs_t>())).emc_rfc_slr_idx as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(burst_regs_t),
            "::",
            stringify!(emc_rfc_slr_idx)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<burst_regs_t>())).emc_ras_idx as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(burst_regs_t),
            "::",
            stringify!(emc_ras_idx)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<burst_regs_t>())).emc_rp_idx as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(burst_regs_t),
            "::",
            stringify!(emc_rp_idx)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<burst_regs_t>())).emc_r2w_idx as *const _ as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(burst_regs_t),
            "::",
            stringify!(emc_r2w_idx)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<burst_regs_t>())).emc_w2r_idx as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(burst_regs_t),
            "::",
            stringify!(emc_w2r_idx)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<burst_regs_t>())).emc_r2p_idx as *const _ as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(burst_regs_t),
            "::",
            stringify!(emc_r2p_idx)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<burst_regs_t>())).emc_w2p_idx as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(burst_regs_t),
            "::",
            stringify!(emc_w2p_idx)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<burst_regs_t>())).emc_r2r_idx as *const _ as usize },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(burst_regs_t),
            "::",
            stringify!(emc_r2r_idx)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<burst_regs_t>())).emc_tppd_idx as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(burst_regs_t),
            "::",
            stringify!(emc_tppd_idx)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<burst_regs_t>())).emc_ccdmw_idx as *const _ as usize },
        52usize,
        concat!(
            "Offset of field: ",
            stringify!(burst_regs_t),
            "::",
            stringify!(emc_ccdmw_idx)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<burst_regs_t>())).emc_rd_rcd_idx as *const _ as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(burst_regs_t),
            "::",
            stringify!(emc_rd_rcd_idx)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<burst_regs_t>())).emc_wr_rcd_idx as *const _ as usize },
        60usize,
        concat!(
            "Offset of field: ",
            stringify!(burst_regs_t),
            "::",
            stringify!(emc_wr_rcd_idx)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<burst_regs_t>())).emc_rrd_idx as *const _ as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(burst_regs_t),
            "::",
            stringify!(emc_rrd_idx)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<burst_regs_t>())).emc_rext_idx as *const _ as usize },
        68usize,
        concat!(
            "Offset of field: ",
            stringify!(burst_regs_t),
            "::",
            stringify!(emc_rext_idx)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<burst_regs_t>())).emc_wext_idx as *const _ as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(burst_regs_t),
            "::",
            stringify!(emc_wext_idx)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<burst_regs_t>())).emc_wdv_chk_idx as *const _ as usize },
        76usize,
        concat!(
            "Offset of field: ",
            stringify!(burst_regs_t),
            "::",
            stringify!(emc_wdv_chk_idx)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<burst_regs_t>())).emc_wdv_idx as *const _ as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(burst_regs_t),
            "::",
            stringify!(emc_wdv_idx)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<burst_regs_t>())).emc_wsv_idx as *const _ as usize },
        84usize,
        concat!(
            "Offset of field: ",
            stringify!(burst_regs_t),
            "::",
            stringify!(emc_wsv_idx)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<burst_regs_t>())).emc_wev_idx as *const _ as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(burst_regs_t),
            "::",
            stringify!(emc_wev_idx)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<burst_regs_t>())).emc_wdv_mask_idx as *const _ as usize },
        92usize,
        concat!(
            "Offset of field: ",
            stringify!(burst_regs_t),
            "::",
            stringify!(emc_wdv_mask_idx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<burst_regs_t>())).emc_ws_duration_idx as *const _ as usize
        },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(burst_regs_t),
            "::",
            stringify!(emc_ws_duration_idx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<burst_regs_t>())).emc_we_duration_idx as *const _ as usize
        },
        100usize,
        concat!(
            "Offset of field: ",
            stringify!(burst_regs_t),
            "::",
            stringify!(emc_we_duration_idx)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<burst_regs_t>())).emc_quse_idx as *const _ as usize },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(burst_regs_t),
            "::",
            stringify!(emc_quse_idx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<burst_regs_t>())).emc_quse_width_idx as *const _ as usize
        },
        108usize,
        concat!(
            "Offset of field: ",
            stringify!(burst_regs_t),
            "::",
            stringify!(emc_quse_width_idx)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<burst_regs_t>())).emc_ibdly_idx as *const _ as usize },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(burst_regs_t),
            "::",
            stringify!(emc_ibdly_idx)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<burst_regs_t>())).emc_obdly_idx as *const _ as usize },
        116usize,
        concat!(
            "Offset of field: ",
            stringify!(burst_regs_t),
            "::",
            stringify!(emc_obdly_idx)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<burst_regs_t>())).emc_einput_idx as *const _ as usize },
        120usize,
        concat!(
            "Offset of field: ",
            stringify!(burst_regs_t),
            "::",
            stringify!(emc_einput_idx)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<burst_regs_t>())).emc_mrw6_idx as *const _ as usize },
        124usize,
        concat!(
            "Offset of field: ",
            stringify!(burst_regs_t),
            "::",
            stringify!(emc_mrw6_idx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<burst_regs_t>())).emc_einput_duration_idx as *const _ as usize
        },
        128usize,
        concat!(
            "Offset of field: ",
            stringify!(burst_regs_t),
            "::",
            stringify!(emc_einput_duration_idx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<burst_regs_t>())).emc_puterm_extra_idx as *const _ as usize
        },
        132usize,
        concat!(
            "Offset of field: ",
            stringify!(burst_regs_t),
            "::",
            stringify!(emc_puterm_extra_idx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<burst_regs_t>())).emc_puterm_width_idx as *const _ as usize
        },
        136usize,
        concat!(
            "Offset of field: ",
            stringify!(burst_regs_t),
            "::",
            stringify!(emc_puterm_width_idx)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<burst_regs_t>())).emc_qrst_idx as *const _ as usize },
        140usize,
        concat!(
            "Offset of field: ",
            stringify!(burst_regs_t),
            "::",
            stringify!(emc_qrst_idx)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<burst_regs_t>())).emc_qsafe_idx as *const _ as usize },
        144usize,
        concat!(
            "Offset of field: ",
            stringify!(burst_regs_t),
            "::",
            stringify!(emc_qsafe_idx)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<burst_regs_t>())).emc_rdv_idx as *const _ as usize },
        148usize,
        concat!(
            "Offset of field: ",
            stringify!(burst_regs_t),
            "::",
            stringify!(emc_rdv_idx)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<burst_regs_t>())).emc_rdv_mask_idx as *const _ as usize },
        152usize,
        concat!(
            "Offset of field: ",
            stringify!(burst_regs_t),
            "::",
            stringify!(emc_rdv_mask_idx)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<burst_regs_t>())).emc_rdv_early_idx as *const _ as usize },
        156usize,
        concat!(
            "Offset of field: ",
            stringify!(burst_regs_t),
            "::",
            stringify!(emc_rdv_early_idx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<burst_regs_t>())).emc_rdv_early_mask_idx as *const _ as usize
        },
        160usize,
        concat!(
            "Offset of field: ",
            stringify!(burst_regs_t),
            "::",
            stringify!(emc_rdv_early_mask_idx)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<burst_regs_t>())).emc_refresh_idx as *const _ as usize },
        164usize,
        concat!(
            "Offset of field: ",
            stringify!(burst_regs_t),
            "::",
            stringify!(emc_refresh_idx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<burst_regs_t>())).emc_burst_refresh_num_idx as *const _ as usize
        },
        168usize,
        concat!(
            "Offset of field: ",
            stringify!(burst_regs_t),
            "::",
            stringify!(emc_burst_refresh_num_idx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<burst_regs_t>())).emc_pre_refresh_req_cnt_idx as *const _
                as usize
        },
        172usize,
        concat!(
            "Offset of field: ",
            stringify!(burst_regs_t),
            "::",
            stringify!(emc_pre_refresh_req_cnt_idx)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<burst_regs_t>())).emc_pdex2wr_idx as *const _ as usize },
        176usize,
        concat!(
            "Offset of field: ",
            stringify!(burst_regs_t),
            "::",
            stringify!(emc_pdex2wr_idx)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<burst_regs_t>())).emc_pdex2rd_idx as *const _ as usize },
        180usize,
        concat!(
            "Offset of field: ",
            stringify!(burst_regs_t),
            "::",
            stringify!(emc_pdex2rd_idx)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<burst_regs_t>())).emc_pchg2pden_idx as *const _ as usize },
        184usize,
        concat!(
            "Offset of field: ",
            stringify!(burst_regs_t),
            "::",
            stringify!(emc_pchg2pden_idx)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<burst_regs_t>())).emc_act2pden_idx as *const _ as usize },
        188usize,
        concat!(
            "Offset of field: ",
            stringify!(burst_regs_t),
            "::",
            stringify!(emc_act2pden_idx)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<burst_regs_t>())).emc_ar2pden_idx as *const _ as usize },
        192usize,
        concat!(
            "Offset of field: ",
            stringify!(burst_regs_t),
            "::",
            stringify!(emc_ar2pden_idx)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<burst_regs_t>())).emc_rw2pden_idx as *const _ as usize },
        196usize,
        concat!(
            "Offset of field: ",
            stringify!(burst_regs_t),
            "::",
            stringify!(emc_rw2pden_idx)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<burst_regs_t>())).emc_cke2pden_idx as *const _ as usize },
        200usize,
        concat!(
            "Offset of field: ",
            stringify!(burst_regs_t),
            "::",
            stringify!(emc_cke2pden_idx)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<burst_regs_t>())).emc_pdex2cke_idx as *const _ as usize },
        204usize,
        concat!(
            "Offset of field: ",
            stringify!(burst_regs_t),
            "::",
            stringify!(emc_pdex2cke_idx)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<burst_regs_t>())).emc_pdex2mrr_idx as *const _ as usize },
        208usize,
        concat!(
            "Offset of field: ",
            stringify!(burst_regs_t),
            "::",
            stringify!(emc_pdex2mrr_idx)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<burst_regs_t>())).emc_txsr_idx as *const _ as usize },
        212usize,
        concat!(
            "Offset of field: ",
            stringify!(burst_regs_t),
            "::",
            stringify!(emc_txsr_idx)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<burst_regs_t>())).emc_txsrdll_idx as *const _ as usize },
        216usize,
        concat!(
            "Offset of field: ",
            stringify!(burst_regs_t),
            "::",
            stringify!(emc_txsrdll_idx)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<burst_regs_t>())).emc_tcke_idx as *const _ as usize },
        220usize,
        concat!(
            "Offset of field: ",
            stringify!(burst_regs_t),
            "::",
            stringify!(emc_tcke_idx)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<burst_regs_t>())).emc_tckesr_idx as *const _ as usize },
        224usize,
        concat!(
            "Offset of field: ",
            stringify!(burst_regs_t),
            "::",
            stringify!(emc_tckesr_idx)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<burst_regs_t>())).emc_tpd_idx as *const _ as usize },
        228usize,
        concat!(
            "Offset of field: ",
            stringify!(burst_regs_t),
            "::",
            stringify!(emc_tpd_idx)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<burst_regs_t>())).emc_tfaw_idx as *const _ as usize },
        232usize,
        concat!(
            "Offset of field: ",
            stringify!(burst_regs_t),
            "::",
            stringify!(emc_tfaw_idx)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<burst_regs_t>())).emc_trpab_idx as *const _ as usize },
        236usize,
        concat!(
            "Offset of field: ",
            stringify!(burst_regs_t),
            "::",
            stringify!(emc_trpab_idx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<burst_regs_t>())).emc_tclkstable_idx as *const _ as usize
        },
        240usize,
        concat!(
            "Offset of field: ",
            stringify!(burst_regs_t),
            "::",
            stringify!(emc_tclkstable_idx)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<burst_regs_t>())).emc_tclkstop_idx as *const _ as usize },
        244usize,
        concat!(
            "Offset of field: ",
            stringify!(burst_regs_t),
            "::",
            stringify!(emc_tclkstop_idx)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<burst_regs_t>())).emc_mrw7_idx as *const _ as usize },
        248usize,
        concat!(
            "Offset of field: ",
            stringify!(burst_regs_t),
            "::",
            stringify!(emc_mrw7_idx)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<burst_regs_t>())).emc_trefbw_idx as *const _ as usize },
        252usize,
        concat!(
            "Offset of field: ",
            stringify!(burst_regs_t),
            "::",
            stringify!(emc_trefbw_idx)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<burst_regs_t>())).emc_odt_write_idx as *const _ as usize },
        256usize,
        concat!(
            "Offset of field: ",
            stringify!(burst_regs_t),
            "::",
            stringify!(emc_odt_write_idx)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<burst_regs_t>())).emc_fbio_cfg5_idx as *const _ as usize },
        260usize,
        concat!(
            "Offset of field: ",
            stringify!(burst_regs_t),
            "::",
            stringify!(emc_fbio_cfg5_idx)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<burst_regs_t>())).emc_fbio_cfg7_idx as *const _ as usize },
        264usize,
        concat!(
            "Offset of field: ",
            stringify!(burst_regs_t),
            "::",
            stringify!(emc_fbio_cfg7_idx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<burst_regs_t>())).emc_cfg_dig_dll_idx as *const _ as usize
        },
        268usize,
        concat!(
            "Offset of field: ",
            stringify!(burst_regs_t),
            "::",
            stringify!(emc_cfg_dig_dll_idx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<burst_regs_t>())).emc_cfg_dig_dll_period_idx as *const _
                as usize
        },
        272usize,
        concat!(
            "Offset of field: ",
            stringify!(burst_regs_t),
            "::",
            stringify!(emc_cfg_dig_dll_period_idx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<burst_regs_t>())).emc_pmacro_ib_rxrt_idx as *const _ as usize
        },
        276usize,
        concat!(
            "Offset of field: ",
            stringify!(burst_regs_t),
            "::",
            stringify!(emc_pmacro_ib_rxrt_idx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<burst_regs_t>())).emc_cfg_pipe_1_idx as *const _ as usize
        },
        280usize,
        concat!(
            "Offset of field: ",
            stringify!(burst_regs_t),
            "::",
            stringify!(emc_cfg_pipe_1_idx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<burst_regs_t>())).emc_cfg_pipe_2_idx as *const _ as usize
        },
        284usize,
        concat!(
            "Offset of field: ",
            stringify!(burst_regs_t),
            "::",
            stringify!(emc_cfg_pipe_2_idx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<burst_regs_t>())).emc_pmacro_quse_ddll_rank0_4_idx as *const _
                as usize
        },
        288usize,
        concat!(
            "Offset of field: ",
            stringify!(burst_regs_t),
            "::",
            stringify!(emc_pmacro_quse_ddll_rank0_4_idx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<burst_regs_t>())).emc_pmacro_quse_ddll_rank0_5_idx as *const _
                as usize
        },
        292usize,
        concat!(
            "Offset of field: ",
            stringify!(burst_regs_t),
            "::",
            stringify!(emc_pmacro_quse_ddll_rank0_5_idx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<burst_regs_t>())).emc_pmacro_quse_ddll_rank1_4_idx as *const _
                as usize
        },
        296usize,
        concat!(
            "Offset of field: ",
            stringify!(burst_regs_t),
            "::",
            stringify!(emc_pmacro_quse_ddll_rank1_4_idx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<burst_regs_t>())).emc_pmacro_quse_ddll_rank1_5_idx as *const _
                as usize
        },
        300usize,
        concat!(
            "Offset of field: ",
            stringify!(burst_regs_t),
            "::",
            stringify!(emc_pmacro_quse_ddll_rank1_5_idx)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<burst_regs_t>())).emc_mrw8_idx as *const _ as usize },
        304usize,
        concat!(
            "Offset of field: ",
            stringify!(burst_regs_t),
            "::",
            stringify!(emc_mrw8_idx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<burst_regs_t>())).emc_pmacro_ob_ddll_long_dq_rank1_4_idx
                as *const _ as usize
        },
        308usize,
        concat!(
            "Offset of field: ",
            stringify!(burst_regs_t),
            "::",
            stringify!(emc_pmacro_ob_ddll_long_dq_rank1_4_idx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<burst_regs_t>())).emc_pmacro_ob_ddll_long_dq_rank1_5_idx
                as *const _ as usize
        },
        312usize,
        concat!(
            "Offset of field: ",
            stringify!(burst_regs_t),
            "::",
            stringify!(emc_pmacro_ob_ddll_long_dq_rank1_5_idx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<burst_regs_t>())).emc_pmacro_ob_ddll_long_dqs_rank0_0_idx
                as *const _ as usize
        },
        316usize,
        concat!(
            "Offset of field: ",
            stringify!(burst_regs_t),
            "::",
            stringify!(emc_pmacro_ob_ddll_long_dqs_rank0_0_idx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<burst_regs_t>())).emc_pmacro_ob_ddll_long_dqs_rank0_1_idx
                as *const _ as usize
        },
        320usize,
        concat!(
            "Offset of field: ",
            stringify!(burst_regs_t),
            "::",
            stringify!(emc_pmacro_ob_ddll_long_dqs_rank0_1_idx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<burst_regs_t>())).emc_pmacro_ob_ddll_long_dqs_rank0_2_idx
                as *const _ as usize
        },
        324usize,
        concat!(
            "Offset of field: ",
            stringify!(burst_regs_t),
            "::",
            stringify!(emc_pmacro_ob_ddll_long_dqs_rank0_2_idx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<burst_regs_t>())).emc_pmacro_ob_ddll_long_dqs_rank0_3_idx
                as *const _ as usize
        },
        328usize,
        concat!(
            "Offset of field: ",
            stringify!(burst_regs_t),
            "::",
            stringify!(emc_pmacro_ob_ddll_long_dqs_rank0_3_idx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<burst_regs_t>())).emc_pmacro_ob_ddll_long_dqs_rank0_4_idx
                as *const _ as usize
        },
        332usize,
        concat!(
            "Offset of field: ",
            stringify!(burst_regs_t),
            "::",
            stringify!(emc_pmacro_ob_ddll_long_dqs_rank0_4_idx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<burst_regs_t>())).emc_pmacro_ob_ddll_long_dqs_rank0_5_idx
                as *const _ as usize
        },
        336usize,
        concat!(
            "Offset of field: ",
            stringify!(burst_regs_t),
            "::",
            stringify!(emc_pmacro_ob_ddll_long_dqs_rank0_5_idx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<burst_regs_t>())).emc_pmacro_ob_ddll_long_dqs_rank1_0_idx
                as *const _ as usize
        },
        340usize,
        concat!(
            "Offset of field: ",
            stringify!(burst_regs_t),
            "::",
            stringify!(emc_pmacro_ob_ddll_long_dqs_rank1_0_idx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<burst_regs_t>())).emc_pmacro_ob_ddll_long_dqs_rank1_1_idx
                as *const _ as usize
        },
        344usize,
        concat!(
            "Offset of field: ",
            stringify!(burst_regs_t),
            "::",
            stringify!(emc_pmacro_ob_ddll_long_dqs_rank1_1_idx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<burst_regs_t>())).emc_pmacro_ob_ddll_long_dqs_rank1_2_idx
                as *const _ as usize
        },
        348usize,
        concat!(
            "Offset of field: ",
            stringify!(burst_regs_t),
            "::",
            stringify!(emc_pmacro_ob_ddll_long_dqs_rank1_2_idx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<burst_regs_t>())).emc_pmacro_ob_ddll_long_dqs_rank1_3_idx
                as *const _ as usize
        },
        352usize,
        concat!(
            "Offset of field: ",
            stringify!(burst_regs_t),
            "::",
            stringify!(emc_pmacro_ob_ddll_long_dqs_rank1_3_idx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<burst_regs_t>())).emc_pmacro_ob_ddll_long_dqs_rank1_4_idx
                as *const _ as usize
        },
        356usize,
        concat!(
            "Offset of field: ",
            stringify!(burst_regs_t),
            "::",
            stringify!(emc_pmacro_ob_ddll_long_dqs_rank1_4_idx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<burst_regs_t>())).emc_pmacro_ob_ddll_long_dqs_rank1_5_idx
                as *const _ as usize
        },
        360usize,
        concat!(
            "Offset of field: ",
            stringify!(burst_regs_t),
            "::",
            stringify!(emc_pmacro_ob_ddll_long_dqs_rank1_5_idx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<burst_regs_t>())).emc_pmacro_ddll_long_cmd_0_idx as *const _
                as usize
        },
        364usize,
        concat!(
            "Offset of field: ",
            stringify!(burst_regs_t),
            "::",
            stringify!(emc_pmacro_ddll_long_cmd_0_idx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<burst_regs_t>())).emc_pmacro_ddll_long_cmd_1_idx as *const _
                as usize
        },
        368usize,
        concat!(
            "Offset of field: ",
            stringify!(burst_regs_t),
            "::",
            stringify!(emc_pmacro_ddll_long_cmd_1_idx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<burst_regs_t>())).emc_pmacro_ddll_long_cmd_2_idx as *const _
                as usize
        },
        372usize,
        concat!(
            "Offset of field: ",
            stringify!(burst_regs_t),
            "::",
            stringify!(emc_pmacro_ddll_long_cmd_2_idx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<burst_regs_t>())).emc_pmacro_ddll_long_cmd_3_idx as *const _
                as usize
        },
        376usize,
        concat!(
            "Offset of field: ",
            stringify!(burst_regs_t),
            "::",
            stringify!(emc_pmacro_ddll_long_cmd_3_idx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<burst_regs_t>())).emc_pmacro_ddll_long_cmd_4_idx as *const _
                as usize
        },
        380usize,
        concat!(
            "Offset of field: ",
            stringify!(burst_regs_t),
            "::",
            stringify!(emc_pmacro_ddll_long_cmd_4_idx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<burst_regs_t>())).emc_pmacro_ddll_short_cmd_0_idx as *const _
                as usize
        },
        384usize,
        concat!(
            "Offset of field: ",
            stringify!(burst_regs_t),
            "::",
            stringify!(emc_pmacro_ddll_short_cmd_0_idx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<burst_regs_t>())).emc_pmacro_ddll_short_cmd_1_idx as *const _
                as usize
        },
        388usize,
        concat!(
            "Offset of field: ",
            stringify!(burst_regs_t),
            "::",
            stringify!(emc_pmacro_ddll_short_cmd_1_idx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<burst_regs_t>())).emc_pmacro_ddll_short_cmd_2_idx as *const _
                as usize
        },
        392usize,
        concat!(
            "Offset of field: ",
            stringify!(burst_regs_t),
            "::",
            stringify!(emc_pmacro_ddll_short_cmd_2_idx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<burst_regs_t>())).emc_pmacro_ob_ddll_short_dq_rank0_byte0_3_idx
                as *const _ as usize
        },
        396usize,
        concat!(
            "Offset of field: ",
            stringify!(burst_regs_t),
            "::",
            stringify!(emc_pmacro_ob_ddll_short_dq_rank0_byte0_3_idx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<burst_regs_t>())).emc_pmacro_ob_ddll_short_dq_rank0_byte1_3_idx
                as *const _ as usize
        },
        400usize,
        concat!(
            "Offset of field: ",
            stringify!(burst_regs_t),
            "::",
            stringify!(emc_pmacro_ob_ddll_short_dq_rank0_byte1_3_idx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<burst_regs_t>())).emc_pmacro_ob_ddll_short_dq_rank0_byte2_3_idx
                as *const _ as usize
        },
        404usize,
        concat!(
            "Offset of field: ",
            stringify!(burst_regs_t),
            "::",
            stringify!(emc_pmacro_ob_ddll_short_dq_rank0_byte2_3_idx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<burst_regs_t>())).emc_pmacro_ob_ddll_short_dq_rank0_byte3_3_idx
                as *const _ as usize
        },
        408usize,
        concat!(
            "Offset of field: ",
            stringify!(burst_regs_t),
            "::",
            stringify!(emc_pmacro_ob_ddll_short_dq_rank0_byte3_3_idx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<burst_regs_t>())).emc_pmacro_ob_ddll_short_dq_rank0_byte4_3_idx
                as *const _ as usize
        },
        412usize,
        concat!(
            "Offset of field: ",
            stringify!(burst_regs_t),
            "::",
            stringify!(emc_pmacro_ob_ddll_short_dq_rank0_byte4_3_idx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<burst_regs_t>())).emc_pmacro_ob_ddll_short_dq_rank0_byte5_3_idx
                as *const _ as usize
        },
        416usize,
        concat!(
            "Offset of field: ",
            stringify!(burst_regs_t),
            "::",
            stringify!(emc_pmacro_ob_ddll_short_dq_rank0_byte5_3_idx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<burst_regs_t>())).emc_pmacro_ob_ddll_short_dq_rank0_byte6_3_idx
                as *const _ as usize
        },
        420usize,
        concat!(
            "Offset of field: ",
            stringify!(burst_regs_t),
            "::",
            stringify!(emc_pmacro_ob_ddll_short_dq_rank0_byte6_3_idx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<burst_regs_t>())).emc_pmacro_ob_ddll_short_dq_rank0_byte7_3_idx
                as *const _ as usize
        },
        424usize,
        concat!(
            "Offset of field: ",
            stringify!(burst_regs_t),
            "::",
            stringify!(emc_pmacro_ob_ddll_short_dq_rank0_byte7_3_idx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<burst_regs_t>())).emc_pmacro_ob_ddll_short_dq_rank0_cmd0_3_idx
                as *const _ as usize
        },
        428usize,
        concat!(
            "Offset of field: ",
            stringify!(burst_regs_t),
            "::",
            stringify!(emc_pmacro_ob_ddll_short_dq_rank0_cmd0_3_idx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<burst_regs_t>())).emc_pmacro_ob_ddll_short_dq_rank0_cmd1_3_idx
                as *const _ as usize
        },
        432usize,
        concat!(
            "Offset of field: ",
            stringify!(burst_regs_t),
            "::",
            stringify!(emc_pmacro_ob_ddll_short_dq_rank0_cmd1_3_idx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<burst_regs_t>())).emc_pmacro_ob_ddll_short_dq_rank0_cmd2_3_idx
                as *const _ as usize
        },
        436usize,
        concat!(
            "Offset of field: ",
            stringify!(burst_regs_t),
            "::",
            stringify!(emc_pmacro_ob_ddll_short_dq_rank0_cmd2_3_idx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<burst_regs_t>())).emc_pmacro_ob_ddll_short_dq_rank0_cmd3_3_idx
                as *const _ as usize
        },
        440usize,
        concat!(
            "Offset of field: ",
            stringify!(burst_regs_t),
            "::",
            stringify!(emc_pmacro_ob_ddll_short_dq_rank0_cmd3_3_idx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<burst_regs_t>())).emc_pmacro_ob_ddll_short_dq_rank1_byte0_3_idx
                as *const _ as usize
        },
        444usize,
        concat!(
            "Offset of field: ",
            stringify!(burst_regs_t),
            "::",
            stringify!(emc_pmacro_ob_ddll_short_dq_rank1_byte0_3_idx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<burst_regs_t>())).emc_pmacro_ob_ddll_short_dq_rank1_byte1_3_idx
                as *const _ as usize
        },
        448usize,
        concat!(
            "Offset of field: ",
            stringify!(burst_regs_t),
            "::",
            stringify!(emc_pmacro_ob_ddll_short_dq_rank1_byte1_3_idx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<burst_regs_t>())).emc_pmacro_ob_ddll_short_dq_rank1_byte2_3_idx
                as *const _ as usize
        },
        452usize,
        concat!(
            "Offset of field: ",
            stringify!(burst_regs_t),
            "::",
            stringify!(emc_pmacro_ob_ddll_short_dq_rank1_byte2_3_idx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<burst_regs_t>())).emc_pmacro_ob_ddll_short_dq_rank1_byte3_3_idx
                as *const _ as usize
        },
        456usize,
        concat!(
            "Offset of field: ",
            stringify!(burst_regs_t),
            "::",
            stringify!(emc_pmacro_ob_ddll_short_dq_rank1_byte3_3_idx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<burst_regs_t>())).emc_pmacro_ob_ddll_short_dq_rank1_byte4_3_idx
                as *const _ as usize
        },
        460usize,
        concat!(
            "Offset of field: ",
            stringify!(burst_regs_t),
            "::",
            stringify!(emc_pmacro_ob_ddll_short_dq_rank1_byte4_3_idx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<burst_regs_t>())).emc_pmacro_ob_ddll_short_dq_rank1_byte5_3_idx
                as *const _ as usize
        },
        464usize,
        concat!(
            "Offset of field: ",
            stringify!(burst_regs_t),
            "::",
            stringify!(emc_pmacro_ob_ddll_short_dq_rank1_byte5_3_idx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<burst_regs_t>())).emc_pmacro_ob_ddll_short_dq_rank1_byte6_3_idx
                as *const _ as usize
        },
        468usize,
        concat!(
            "Offset of field: ",
            stringify!(burst_regs_t),
            "::",
            stringify!(emc_pmacro_ob_ddll_short_dq_rank1_byte6_3_idx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<burst_regs_t>())).emc_pmacro_ob_ddll_short_dq_rank1_byte7_3_idx
                as *const _ as usize
        },
        472usize,
        concat!(
            "Offset of field: ",
            stringify!(burst_regs_t),
            "::",
            stringify!(emc_pmacro_ob_ddll_short_dq_rank1_byte7_3_idx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<burst_regs_t>())).emc_pmacro_ob_ddll_short_dq_rank1_cmd0_0_idx
                as *const _ as usize
        },
        476usize,
        concat!(
            "Offset of field: ",
            stringify!(burst_regs_t),
            "::",
            stringify!(emc_pmacro_ob_ddll_short_dq_rank1_cmd0_0_idx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<burst_regs_t>())).emc_pmacro_ob_ddll_short_dq_rank1_cmd0_1_idx
                as *const _ as usize
        },
        480usize,
        concat!(
            "Offset of field: ",
            stringify!(burst_regs_t),
            "::",
            stringify!(emc_pmacro_ob_ddll_short_dq_rank1_cmd0_1_idx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<burst_regs_t>())).emc_pmacro_ob_ddll_short_dq_rank1_cmd0_2_idx
                as *const _ as usize
        },
        484usize,
        concat!(
            "Offset of field: ",
            stringify!(burst_regs_t),
            "::",
            stringify!(emc_pmacro_ob_ddll_short_dq_rank1_cmd0_2_idx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<burst_regs_t>())).emc_pmacro_ob_ddll_short_dq_rank1_cmd0_3_idx
                as *const _ as usize
        },
        488usize,
        concat!(
            "Offset of field: ",
            stringify!(burst_regs_t),
            "::",
            stringify!(emc_pmacro_ob_ddll_short_dq_rank1_cmd0_3_idx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<burst_regs_t>())).emc_pmacro_ob_ddll_short_dq_rank1_cmd1_0_idx
                as *const _ as usize
        },
        492usize,
        concat!(
            "Offset of field: ",
            stringify!(burst_regs_t),
            "::",
            stringify!(emc_pmacro_ob_ddll_short_dq_rank1_cmd1_0_idx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<burst_regs_t>())).emc_pmacro_ob_ddll_short_dq_rank1_cmd1_1_idx
                as *const _ as usize
        },
        496usize,
        concat!(
            "Offset of field: ",
            stringify!(burst_regs_t),
            "::",
            stringify!(emc_pmacro_ob_ddll_short_dq_rank1_cmd1_1_idx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<burst_regs_t>())).emc_pmacro_ob_ddll_short_dq_rank1_cmd1_2_idx
                as *const _ as usize
        },
        500usize,
        concat!(
            "Offset of field: ",
            stringify!(burst_regs_t),
            "::",
            stringify!(emc_pmacro_ob_ddll_short_dq_rank1_cmd1_2_idx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<burst_regs_t>())).emc_pmacro_ob_ddll_short_dq_rank1_cmd1_3_idx
                as *const _ as usize
        },
        504usize,
        concat!(
            "Offset of field: ",
            stringify!(burst_regs_t),
            "::",
            stringify!(emc_pmacro_ob_ddll_short_dq_rank1_cmd1_3_idx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<burst_regs_t>())).emc_pmacro_ob_ddll_short_dq_rank1_cmd2_0_idx
                as *const _ as usize
        },
        508usize,
        concat!(
            "Offset of field: ",
            stringify!(burst_regs_t),
            "::",
            stringify!(emc_pmacro_ob_ddll_short_dq_rank1_cmd2_0_idx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<burst_regs_t>())).emc_pmacro_ob_ddll_short_dq_rank1_cmd2_1_idx
                as *const _ as usize
        },
        512usize,
        concat!(
            "Offset of field: ",
            stringify!(burst_regs_t),
            "::",
            stringify!(emc_pmacro_ob_ddll_short_dq_rank1_cmd2_1_idx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<burst_regs_t>())).emc_pmacro_ob_ddll_short_dq_rank1_cmd2_2_idx
                as *const _ as usize
        },
        516usize,
        concat!(
            "Offset of field: ",
            stringify!(burst_regs_t),
            "::",
            stringify!(emc_pmacro_ob_ddll_short_dq_rank1_cmd2_2_idx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<burst_regs_t>())).emc_pmacro_ob_ddll_short_dq_rank1_cmd2_3_idx
                as *const _ as usize
        },
        520usize,
        concat!(
            "Offset of field: ",
            stringify!(burst_regs_t),
            "::",
            stringify!(emc_pmacro_ob_ddll_short_dq_rank1_cmd2_3_idx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<burst_regs_t>())).emc_pmacro_ob_ddll_short_dq_rank1_cmd3_0_idx
                as *const _ as usize
        },
        524usize,
        concat!(
            "Offset of field: ",
            stringify!(burst_regs_t),
            "::",
            stringify!(emc_pmacro_ob_ddll_short_dq_rank1_cmd3_0_idx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<burst_regs_t>())).emc_pmacro_ob_ddll_short_dq_rank1_cmd3_1_idx
                as *const _ as usize
        },
        528usize,
        concat!(
            "Offset of field: ",
            stringify!(burst_regs_t),
            "::",
            stringify!(emc_pmacro_ob_ddll_short_dq_rank1_cmd3_1_idx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<burst_regs_t>())).emc_pmacro_ob_ddll_short_dq_rank1_cmd3_2_idx
                as *const _ as usize
        },
        532usize,
        concat!(
            "Offset of field: ",
            stringify!(burst_regs_t),
            "::",
            stringify!(emc_pmacro_ob_ddll_short_dq_rank1_cmd3_2_idx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<burst_regs_t>())).emc_pmacro_ob_ddll_short_dq_rank1_cmd3_3_idx
                as *const _ as usize
        },
        536usize,
        concat!(
            "Offset of field: ",
            stringify!(burst_regs_t),
            "::",
            stringify!(emc_pmacro_ob_ddll_short_dq_rank1_cmd3_3_idx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<burst_regs_t>())).emc_txdsrvttgen_idx as *const _ as usize
        },
        540usize,
        concat!(
            "Offset of field: ",
            stringify!(burst_regs_t),
            "::",
            stringify!(emc_txdsrvttgen_idx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<burst_regs_t>())).emc_fdpd_ctrl_dq_idx as *const _ as usize
        },
        544usize,
        concat!(
            "Offset of field: ",
            stringify!(burst_regs_t),
            "::",
            stringify!(emc_fdpd_ctrl_dq_idx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<burst_regs_t>())).emc_fdpd_ctrl_cmd_idx as *const _ as usize
        },
        548usize,
        concat!(
            "Offset of field: ",
            stringify!(burst_regs_t),
            "::",
            stringify!(emc_fdpd_ctrl_cmd_idx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<burst_regs_t>())).emc_fbio_spare_idx as *const _ as usize
        },
        552usize,
        concat!(
            "Offset of field: ",
            stringify!(burst_regs_t),
            "::",
            stringify!(emc_fbio_spare_idx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<burst_regs_t>())).emc_zcal_interval_idx as *const _ as usize
        },
        556usize,
        concat!(
            "Offset of field: ",
            stringify!(burst_regs_t),
            "::",
            stringify!(emc_zcal_interval_idx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<burst_regs_t>())).emc_zcal_wait_cnt_idx as *const _ as usize
        },
        560usize,
        concat!(
            "Offset of field: ",
            stringify!(burst_regs_t),
            "::",
            stringify!(emc_zcal_wait_cnt_idx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<burst_regs_t>())).emc_mrs_wait_cnt_idx as *const _ as usize
        },
        564usize,
        concat!(
            "Offset of field: ",
            stringify!(burst_regs_t),
            "::",
            stringify!(emc_mrs_wait_cnt_idx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<burst_regs_t>())).emc_mrs_wait_cnt2_idx as *const _ as usize
        },
        568usize,
        concat!(
            "Offset of field: ",
            stringify!(burst_regs_t),
            "::",
            stringify!(emc_mrs_wait_cnt2_idx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<burst_regs_t>())).emc_auto_cal_channel_idx as *const _ as usize
        },
        572usize,
        concat!(
            "Offset of field: ",
            stringify!(burst_regs_t),
            "::",
            stringify!(emc_auto_cal_channel_idx)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<burst_regs_t>())).emc_dll_cfg_0_idx as *const _ as usize },
        576usize,
        concat!(
            "Offset of field: ",
            stringify!(burst_regs_t),
            "::",
            stringify!(emc_dll_cfg_0_idx)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<burst_regs_t>())).emc_dll_cfg_1_idx as *const _ as usize },
        580usize,
        concat!(
            "Offset of field: ",
            stringify!(burst_regs_t),
            "::",
            stringify!(emc_dll_cfg_1_idx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<burst_regs_t>())).emc_pmacro_autocal_cfg_common_idx as *const _
                as usize
        },
        584usize,
        concat!(
            "Offset of field: ",
            stringify!(burst_regs_t),
            "::",
            stringify!(emc_pmacro_autocal_cfg_common_idx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<burst_regs_t>())).emc_pmacro_zctrl_idx as *const _ as usize
        },
        588usize,
        concat!(
            "Offset of field: ",
            stringify!(burst_regs_t),
            "::",
            stringify!(emc_pmacro_zctrl_idx)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<burst_regs_t>())).emc_cfg_idx as *const _ as usize },
        592usize,
        concat!(
            "Offset of field: ",
            stringify!(burst_regs_t),
            "::",
            stringify!(emc_cfg_idx)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<burst_regs_t>())).emc_cfg_pipe_idx as *const _ as usize },
        596usize,
        concat!(
            "Offset of field: ",
            stringify!(burst_regs_t),
            "::",
            stringify!(emc_cfg_pipe_idx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<burst_regs_t>())).emc_dyn_self_ref_control_idx as *const _
                as usize
        },
        600usize,
        concat!(
            "Offset of field: ",
            stringify!(burst_regs_t),
            "::",
            stringify!(emc_dyn_self_ref_control_idx)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<burst_regs_t>())).emc_qpop_idx as *const _ as usize },
        604usize,
        concat!(
            "Offset of field: ",
            stringify!(burst_regs_t),
            "::",
            stringify!(emc_qpop_idx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<burst_regs_t>())).emc_dqs_brlshft_0_idx as *const _ as usize
        },
        608usize,
        concat!(
            "Offset of field: ",
            stringify!(burst_regs_t),
            "::",
            stringify!(emc_dqs_brlshft_0_idx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<burst_regs_t>())).emc_dqs_brlshft_1_idx as *const _ as usize
        },
        612usize,
        concat!(
            "Offset of field: ",
            stringify!(burst_regs_t),
            "::",
            stringify!(emc_dqs_brlshft_1_idx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<burst_regs_t>())).emc_cmd_brlshft_2_idx as *const _ as usize
        },
        616usize,
        concat!(
            "Offset of field: ",
            stringify!(burst_regs_t),
            "::",
            stringify!(emc_cmd_brlshft_2_idx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<burst_regs_t>())).emc_cmd_brlshft_3_idx as *const _ as usize
        },
        620usize,
        concat!(
            "Offset of field: ",
            stringify!(burst_regs_t),
            "::",
            stringify!(emc_cmd_brlshft_3_idx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<burst_regs_t>())).emc_pmacro_pad_cfg_ctrl_idx as *const _
                as usize
        },
        624usize,
        concat!(
            "Offset of field: ",
            stringify!(burst_regs_t),
            "::",
            stringify!(emc_pmacro_pad_cfg_ctrl_idx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<burst_regs_t>())).emc_pmacro_data_pad_rx_ctrl_idx as *const _
                as usize
        },
        628usize,
        concat!(
            "Offset of field: ",
            stringify!(burst_regs_t),
            "::",
            stringify!(emc_pmacro_data_pad_rx_ctrl_idx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<burst_regs_t>())).emc_pmacro_cmd_pad_rx_ctrl_idx as *const _
                as usize
        },
        632usize,
        concat!(
            "Offset of field: ",
            stringify!(burst_regs_t),
            "::",
            stringify!(emc_pmacro_cmd_pad_rx_ctrl_idx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<burst_regs_t>())).emc_pmacro_data_rx_term_mode_idx as *const _
                as usize
        },
        636usize,
        concat!(
            "Offset of field: ",
            stringify!(burst_regs_t),
            "::",
            stringify!(emc_pmacro_data_rx_term_mode_idx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<burst_regs_t>())).emc_pmacro_cmd_rx_term_mode_idx as *const _
                as usize
        },
        640usize,
        concat!(
            "Offset of field: ",
            stringify!(burst_regs_t),
            "::",
            stringify!(emc_pmacro_cmd_rx_term_mode_idx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<burst_regs_t>())).emc_pmacro_cmd_pad_tx_ctrl_idx as *const _
                as usize
        },
        644usize,
        concat!(
            "Offset of field: ",
            stringify!(burst_regs_t),
            "::",
            stringify!(emc_pmacro_cmd_pad_tx_ctrl_idx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<burst_regs_t>())).emc_pmacro_data_pad_tx_ctrl_idx as *const _
                as usize
        },
        648usize,
        concat!(
            "Offset of field: ",
            stringify!(burst_regs_t),
            "::",
            stringify!(emc_pmacro_data_pad_tx_ctrl_idx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<burst_regs_t>())).emc_pmacro_common_pad_tx_ctrl_idx as *const _
                as usize
        },
        652usize,
        concat!(
            "Offset of field: ",
            stringify!(burst_regs_t),
            "::",
            stringify!(emc_pmacro_common_pad_tx_ctrl_idx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<burst_regs_t>())).emc_pmacro_vttgen_ctrl_0_idx as *const _
                as usize
        },
        656usize,
        concat!(
            "Offset of field: ",
            stringify!(burst_regs_t),
            "::",
            stringify!(emc_pmacro_vttgen_ctrl_0_idx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<burst_regs_t>())).emc_pmacro_vttgen_ctrl_1_idx as *const _
                as usize
        },
        660usize,
        concat!(
            "Offset of field: ",
            stringify!(burst_regs_t),
            "::",
            stringify!(emc_pmacro_vttgen_ctrl_1_idx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<burst_regs_t>())).emc_pmacro_vttgen_ctrl_2_idx as *const _
                as usize
        },
        664usize,
        concat!(
            "Offset of field: ",
            stringify!(burst_regs_t),
            "::",
            stringify!(emc_pmacro_vttgen_ctrl_2_idx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<burst_regs_t>())).emc_pmacro_brick_ctrl_rfu1_idx as *const _
                as usize
        },
        668usize,
        concat!(
            "Offset of field: ",
            stringify!(burst_regs_t),
            "::",
            stringify!(emc_pmacro_brick_ctrl_rfu1_idx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<burst_regs_t>())).emc_pmacro_cmd_brick_ctrl_fdpd_idx as *const _
                as usize
        },
        672usize,
        concat!(
            "Offset of field: ",
            stringify!(burst_regs_t),
            "::",
            stringify!(emc_pmacro_cmd_brick_ctrl_fdpd_idx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<burst_regs_t>())).emc_pmacro_brick_ctrl_rfu2_idx as *const _
                as usize
        },
        676usize,
        concat!(
            "Offset of field: ",
            stringify!(burst_regs_t),
            "::",
            stringify!(emc_pmacro_brick_ctrl_rfu2_idx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<burst_regs_t>())).emc_pmacro_data_brick_ctrl_fdpd_idx
                as *const _ as usize
        },
        680usize,
        concat!(
            "Offset of field: ",
            stringify!(burst_regs_t),
            "::",
            stringify!(emc_pmacro_data_brick_ctrl_fdpd_idx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<burst_regs_t>())).emc_pmacro_bg_bias_ctrl_0_idx as *const _
                as usize
        },
        684usize,
        concat!(
            "Offset of field: ",
            stringify!(burst_regs_t),
            "::",
            stringify!(emc_pmacro_bg_bias_ctrl_0_idx)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<burst_regs_t>())).emc_cfg_3_idx as *const _ as usize },
        688usize,
        concat!(
            "Offset of field: ",
            stringify!(burst_regs_t),
            "::",
            stringify!(emc_cfg_3_idx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<burst_regs_t>())).emc_pmacro_tx_pwrd_0_idx as *const _ as usize
        },
        692usize,
        concat!(
            "Offset of field: ",
            stringify!(burst_regs_t),
            "::",
            stringify!(emc_pmacro_tx_pwrd_0_idx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<burst_regs_t>())).emc_pmacro_tx_pwrd_1_idx as *const _ as usize
        },
        696usize,
        concat!(
            "Offset of field: ",
            stringify!(burst_regs_t),
            "::",
            stringify!(emc_pmacro_tx_pwrd_1_idx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<burst_regs_t>())).emc_pmacro_tx_pwrd_2_idx as *const _ as usize
        },
        700usize,
        concat!(
            "Offset of field: ",
            stringify!(burst_regs_t),
            "::",
            stringify!(emc_pmacro_tx_pwrd_2_idx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<burst_regs_t>())).emc_pmacro_tx_pwrd_3_idx as *const _ as usize
        },
        704usize,
        concat!(
            "Offset of field: ",
            stringify!(burst_regs_t),
            "::",
            stringify!(emc_pmacro_tx_pwrd_3_idx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<burst_regs_t>())).emc_pmacro_tx_pwrd_4_idx as *const _ as usize
        },
        708usize,
        concat!(
            "Offset of field: ",
            stringify!(burst_regs_t),
            "::",
            stringify!(emc_pmacro_tx_pwrd_4_idx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<burst_regs_t>())).emc_pmacro_tx_pwrd_5_idx as *const _ as usize
        },
        712usize,
        concat!(
            "Offset of field: ",
            stringify!(burst_regs_t),
            "::",
            stringify!(emc_pmacro_tx_pwrd_5_idx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<burst_regs_t>())).emc_config_sample_delay_idx as *const _
                as usize
        },
        716usize,
        concat!(
            "Offset of field: ",
            stringify!(burst_regs_t),
            "::",
            stringify!(emc_config_sample_delay_idx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<burst_regs_t>())).emc_pmacro_tx_sel_clk_src_0_idx as *const _
                as usize
        },
        720usize,
        concat!(
            "Offset of field: ",
            stringify!(burst_regs_t),
            "::",
            stringify!(emc_pmacro_tx_sel_clk_src_0_idx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<burst_regs_t>())).emc_pmacro_tx_sel_clk_src_1_idx as *const _
                as usize
        },
        724usize,
        concat!(
            "Offset of field: ",
            stringify!(burst_regs_t),
            "::",
            stringify!(emc_pmacro_tx_sel_clk_src_1_idx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<burst_regs_t>())).emc_pmacro_tx_sel_clk_src_2_idx as *const _
                as usize
        },
        728usize,
        concat!(
            "Offset of field: ",
            stringify!(burst_regs_t),
            "::",
            stringify!(emc_pmacro_tx_sel_clk_src_2_idx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<burst_regs_t>())).emc_pmacro_tx_sel_clk_src_3_idx as *const _
                as usize
        },
        732usize,
        concat!(
            "Offset of field: ",
            stringify!(burst_regs_t),
            "::",
            stringify!(emc_pmacro_tx_sel_clk_src_3_idx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<burst_regs_t>())).emc_pmacro_tx_sel_clk_src_4_idx as *const _
                as usize
        },
        736usize,
        concat!(
            "Offset of field: ",
            stringify!(burst_regs_t),
            "::",
            stringify!(emc_pmacro_tx_sel_clk_src_4_idx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<burst_regs_t>())).emc_pmacro_tx_sel_clk_src_5_idx as *const _
                as usize
        },
        740usize,
        concat!(
            "Offset of field: ",
            stringify!(burst_regs_t),
            "::",
            stringify!(emc_pmacro_tx_sel_clk_src_5_idx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<burst_regs_t>())).emc_pmacro_ddll_bypass_idx as *const _
                as usize
        },
        744usize,
        concat!(
            "Offset of field: ",
            stringify!(burst_regs_t),
            "::",
            stringify!(emc_pmacro_ddll_bypass_idx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<burst_regs_t>())).emc_pmacro_ddll_pwrd_0_idx as *const _
                as usize
        },
        748usize,
        concat!(
            "Offset of field: ",
            stringify!(burst_regs_t),
            "::",
            stringify!(emc_pmacro_ddll_pwrd_0_idx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<burst_regs_t>())).emc_pmacro_ddll_pwrd_1_idx as *const _
                as usize
        },
        752usize,
        concat!(
            "Offset of field: ",
            stringify!(burst_regs_t),
            "::",
            stringify!(emc_pmacro_ddll_pwrd_1_idx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<burst_regs_t>())).emc_pmacro_ddll_pwrd_2_idx as *const _
                as usize
        },
        756usize,
        concat!(
            "Offset of field: ",
            stringify!(burst_regs_t),
            "::",
            stringify!(emc_pmacro_ddll_pwrd_2_idx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<burst_regs_t>())).emc_pmacro_cmd_ctrl_0_idx as *const _ as usize
        },
        760usize,
        concat!(
            "Offset of field: ",
            stringify!(burst_regs_t),
            "::",
            stringify!(emc_pmacro_cmd_ctrl_0_idx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<burst_regs_t>())).emc_pmacro_cmd_ctrl_1_idx as *const _ as usize
        },
        764usize,
        concat!(
            "Offset of field: ",
            stringify!(burst_regs_t),
            "::",
            stringify!(emc_pmacro_cmd_ctrl_1_idx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<burst_regs_t>())).emc_pmacro_cmd_ctrl_2_idx as *const _ as usize
        },
        768usize,
        concat!(
            "Offset of field: ",
            stringify!(burst_regs_t),
            "::",
            stringify!(emc_pmacro_cmd_ctrl_2_idx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<burst_regs_t>())).emc_tr_timing_0_idx as *const _ as usize
        },
        772usize,
        concat!(
            "Offset of field: ",
            stringify!(burst_regs_t),
            "::",
            stringify!(emc_tr_timing_0_idx)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<burst_regs_t>())).emc_tr_dvfs_idx as *const _ as usize },
        776usize,
        concat!(
            "Offset of field: ",
            stringify!(burst_regs_t),
            "::",
            stringify!(emc_tr_dvfs_idx)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<burst_regs_t>())).emc_tr_ctrl_1_idx as *const _ as usize },
        780usize,
        concat!(
            "Offset of field: ",
            stringify!(burst_regs_t),
            "::",
            stringify!(emc_tr_ctrl_1_idx)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<burst_regs_t>())).emc_tr_rdv_idx as *const _ as usize },
        784usize,
        concat!(
            "Offset of field: ",
            stringify!(burst_regs_t),
            "::",
            stringify!(emc_tr_rdv_idx)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<burst_regs_t>())).emc_tr_qpop_idx as *const _ as usize },
        788usize,
        concat!(
            "Offset of field: ",
            stringify!(burst_regs_t),
            "::",
            stringify!(emc_tr_qpop_idx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<burst_regs_t>())).emc_tr_rdv_mask_idx as *const _ as usize
        },
        792usize,
        concat!(
            "Offset of field: ",
            stringify!(burst_regs_t),
            "::",
            stringify!(emc_tr_rdv_mask_idx)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<burst_regs_t>())).emc_mrw14_idx as *const _ as usize },
        796usize,
        concat!(
            "Offset of field: ",
            stringify!(burst_regs_t),
            "::",
            stringify!(emc_mrw14_idx)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<burst_regs_t>())).emc_tr_qsafe_idx as *const _ as usize },
        800usize,
        concat!(
            "Offset of field: ",
            stringify!(burst_regs_t),
            "::",
            stringify!(emc_tr_qsafe_idx)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<burst_regs_t>())).emc_tr_qrst_idx as *const _ as usize },
        804usize,
        concat!(
            "Offset of field: ",
            stringify!(burst_regs_t),
            "::",
            stringify!(emc_tr_qrst_idx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<burst_regs_t>())).emc_training_ctrl_idx as *const _ as usize
        },
        808usize,
        concat!(
            "Offset of field: ",
            stringify!(burst_regs_t),
            "::",
            stringify!(emc_training_ctrl_idx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<burst_regs_t>())).emc_training_settle_idx as *const _ as usize
        },
        812usize,
        concat!(
            "Offset of field: ",
            stringify!(burst_regs_t),
            "::",
            stringify!(emc_training_settle_idx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<burst_regs_t>())).emc_training_vref_settle_idx as *const _
                as usize
        },
        816usize,
        concat!(
            "Offset of field: ",
            stringify!(burst_regs_t),
            "::",
            stringify!(emc_training_vref_settle_idx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<burst_regs_t>())).emc_training_ca_fine_ctrl_idx as *const _
                as usize
        },
        820usize,
        concat!(
            "Offset of field: ",
            stringify!(burst_regs_t),
            "::",
            stringify!(emc_training_ca_fine_ctrl_idx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<burst_regs_t>())).emc_training_ca_ctrl_misc_idx as *const _
                as usize
        },
        824usize,
        concat!(
            "Offset of field: ",
            stringify!(burst_regs_t),
            "::",
            stringify!(emc_training_ca_ctrl_misc_idx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<burst_regs_t>())).emc_training_ca_ctrl_misc1_idx as *const _
                as usize
        },
        828usize,
        concat!(
            "Offset of field: ",
            stringify!(burst_regs_t),
            "::",
            stringify!(emc_training_ca_ctrl_misc1_idx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<burst_regs_t>())).emc_training_ca_vref_ctrl_idx as *const _
                as usize
        },
        832usize,
        concat!(
            "Offset of field: ",
            stringify!(burst_regs_t),
            "::",
            stringify!(emc_training_ca_vref_ctrl_idx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<burst_regs_t>())).emc_training_quse_cors_ctrl_idx as *const _
                as usize
        },
        836usize,
        concat!(
            "Offset of field: ",
            stringify!(burst_regs_t),
            "::",
            stringify!(emc_training_quse_cors_ctrl_idx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<burst_regs_t>())).emc_training_quse_fine_ctrl_idx as *const _
                as usize
        },
        840usize,
        concat!(
            "Offset of field: ",
            stringify!(burst_regs_t),
            "::",
            stringify!(emc_training_quse_fine_ctrl_idx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<burst_regs_t>())).emc_training_quse_ctrl_misc_idx as *const _
                as usize
        },
        844usize,
        concat!(
            "Offset of field: ",
            stringify!(burst_regs_t),
            "::",
            stringify!(emc_training_quse_ctrl_misc_idx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<burst_regs_t>())).emc_training_quse_vref_ctrl_idx as *const _
                as usize
        },
        848usize,
        concat!(
            "Offset of field: ",
            stringify!(burst_regs_t),
            "::",
            stringify!(emc_training_quse_vref_ctrl_idx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<burst_regs_t>())).emc_training_read_fine_ctrl_idx as *const _
                as usize
        },
        852usize,
        concat!(
            "Offset of field: ",
            stringify!(burst_regs_t),
            "::",
            stringify!(emc_training_read_fine_ctrl_idx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<burst_regs_t>())).emc_training_read_ctrl_misc_idx as *const _
                as usize
        },
        856usize,
        concat!(
            "Offset of field: ",
            stringify!(burst_regs_t),
            "::",
            stringify!(emc_training_read_ctrl_misc_idx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<burst_regs_t>())).emc_training_read_vref_ctrl_idx as *const _
                as usize
        },
        860usize,
        concat!(
            "Offset of field: ",
            stringify!(burst_regs_t),
            "::",
            stringify!(emc_training_read_vref_ctrl_idx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<burst_regs_t>())).emc_training_write_fine_ctrl_idx as *const _
                as usize
        },
        864usize,
        concat!(
            "Offset of field: ",
            stringify!(burst_regs_t),
            "::",
            stringify!(emc_training_write_fine_ctrl_idx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<burst_regs_t>())).emc_training_write_ctrl_misc_idx as *const _
                as usize
        },
        868usize,
        concat!(
            "Offset of field: ",
            stringify!(burst_regs_t),
            "::",
            stringify!(emc_training_write_ctrl_misc_idx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<burst_regs_t>())).emc_training_write_vref_ctrl_idx as *const _
                as usize
        },
        872usize,
        concat!(
            "Offset of field: ",
            stringify!(burst_regs_t),
            "::",
            stringify!(emc_training_write_vref_ctrl_idx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<burst_regs_t>())).emc_training_mpc_idx as *const _ as usize
        },
        876usize,
        concat!(
            "Offset of field: ",
            stringify!(burst_regs_t),
            "::",
            stringify!(emc_training_mpc_idx)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<burst_regs_t>())).emc_mrw15_idx as *const _ as usize },
        880usize,
        concat!(
            "Offset of field: ",
            stringify!(burst_regs_t),
            "::",
            stringify!(emc_mrw15_idx)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ptfv_list_table_t {
    pub ptfv_dqsosc_movavg_c0d0u0_idx: u32_,
    pub ptfv_dqsosc_movavg_c0d0u1_idx: u32_,
    pub ptfv_dqsosc_movavg_c0d1u0_idx: u32_,
    pub ptfv_dqsosc_movavg_c0d1u1_idx: u32_,
    pub ptfv_dqsosc_movavg_c1d0u0_idx: u32_,
    pub ptfv_dqsosc_movavg_c1d0u1_idx: u32_,
    pub ptfv_dqsosc_movavg_c1d1u0_idx: u32_,
    pub ptfv_dqsosc_movavg_c1d1u1_idx: u32_,
    pub ptfv_write_samples_idx: u32_,
    pub ptfv_dvfs_samples_idx: u32_,
    pub ptfv_movavg_weight_idx: u32_,
    pub ptfv_config_ctrl_idx: u32_,
}
#[test]
fn bindgen_test_layout_ptfv_list_table_t() {
    assert_eq!(
        ::core::mem::size_of::<ptfv_list_table_t>(),
        48usize,
        concat!("Size of: ", stringify!(ptfv_list_table_t))
    );
    assert_eq!(
        ::core::mem::align_of::<ptfv_list_table_t>(),
        4usize,
        concat!("Alignment of ", stringify!(ptfv_list_table_t))
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<ptfv_list_table_t>())).ptfv_dqsosc_movavg_c0d0u0_idx as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ptfv_list_table_t),
            "::",
            stringify!(ptfv_dqsosc_movavg_c0d0u0_idx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<ptfv_list_table_t>())).ptfv_dqsosc_movavg_c0d0u1_idx as *const _
                as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(ptfv_list_table_t),
            "::",
            stringify!(ptfv_dqsosc_movavg_c0d0u1_idx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<ptfv_list_table_t>())).ptfv_dqsosc_movavg_c0d1u0_idx as *const _
                as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ptfv_list_table_t),
            "::",
            stringify!(ptfv_dqsosc_movavg_c0d1u0_idx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<ptfv_list_table_t>())).ptfv_dqsosc_movavg_c0d1u1_idx as *const _
                as usize
        },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(ptfv_list_table_t),
            "::",
            stringify!(ptfv_dqsosc_movavg_c0d1u1_idx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<ptfv_list_table_t>())).ptfv_dqsosc_movavg_c1d0u0_idx as *const _
                as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(ptfv_list_table_t),
            "::",
            stringify!(ptfv_dqsosc_movavg_c1d0u0_idx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<ptfv_list_table_t>())).ptfv_dqsosc_movavg_c1d0u1_idx as *const _
                as usize
        },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(ptfv_list_table_t),
            "::",
            stringify!(ptfv_dqsosc_movavg_c1d0u1_idx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<ptfv_list_table_t>())).ptfv_dqsosc_movavg_c1d1u0_idx as *const _
                as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(ptfv_list_table_t),
            "::",
            stringify!(ptfv_dqsosc_movavg_c1d1u0_idx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<ptfv_list_table_t>())).ptfv_dqsosc_movavg_c1d1u1_idx as *const _
                as usize
        },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(ptfv_list_table_t),
            "::",
            stringify!(ptfv_dqsosc_movavg_c1d1u1_idx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<ptfv_list_table_t>())).ptfv_write_samples_idx as *const _
                as usize
        },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(ptfv_list_table_t),
            "::",
            stringify!(ptfv_write_samples_idx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<ptfv_list_table_t>())).ptfv_dvfs_samples_idx as *const _
                as usize
        },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(ptfv_list_table_t),
            "::",
            stringify!(ptfv_dvfs_samples_idx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<ptfv_list_table_t>())).ptfv_movavg_weight_idx as *const _
                as usize
        },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(ptfv_list_table_t),
            "::",
            stringify!(ptfv_movavg_weight_idx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<ptfv_list_table_t>())).ptfv_config_ctrl_idx as *const _ as usize
        },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(ptfv_list_table_t),
            "::",
            stringify!(ptfv_config_ctrl_idx)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct burst_reg_per_ch_t {
    pub emc0_mrw10_idx: u32_,
    pub emc1_mrw10_idx: u32_,
    pub emc0_mrw11_idx: u32_,
    pub emc1_mrw11_idx: u32_,
    pub emc0_mrw12_idx: u32_,
    pub emc1_mrw12_idx: u32_,
    pub emc0_mrw13_idx: u32_,
    pub emc1_mrw13_idx: u32_,
}
#[test]
fn bindgen_test_layout_burst_reg_per_ch_t() {
    assert_eq!(
        ::core::mem::size_of::<burst_reg_per_ch_t>(),
        32usize,
        concat!("Size of: ", stringify!(burst_reg_per_ch_t))
    );
    assert_eq!(
        ::core::mem::align_of::<burst_reg_per_ch_t>(),
        4usize,
        concat!("Alignment of ", stringify!(burst_reg_per_ch_t))
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<burst_reg_per_ch_t>())).emc0_mrw10_idx as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(burst_reg_per_ch_t),
            "::",
            stringify!(emc0_mrw10_idx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<burst_reg_per_ch_t>())).emc1_mrw10_idx as *const _ as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(burst_reg_per_ch_t),
            "::",
            stringify!(emc1_mrw10_idx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<burst_reg_per_ch_t>())).emc0_mrw11_idx as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(burst_reg_per_ch_t),
            "::",
            stringify!(emc0_mrw11_idx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<burst_reg_per_ch_t>())).emc1_mrw11_idx as *const _ as usize
        },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(burst_reg_per_ch_t),
            "::",
            stringify!(emc1_mrw11_idx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<burst_reg_per_ch_t>())).emc0_mrw12_idx as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(burst_reg_per_ch_t),
            "::",
            stringify!(emc0_mrw12_idx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<burst_reg_per_ch_t>())).emc1_mrw12_idx as *const _ as usize
        },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(burst_reg_per_ch_t),
            "::",
            stringify!(emc1_mrw12_idx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<burst_reg_per_ch_t>())).emc0_mrw13_idx as *const _ as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(burst_reg_per_ch_t),
            "::",
            stringify!(emc0_mrw13_idx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<burst_reg_per_ch_t>())).emc1_mrw13_idx as *const _ as usize
        },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(burst_reg_per_ch_t),
            "::",
            stringify!(emc1_mrw13_idx)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct trim_regs_t {
    pub emc_pmacro_ib_ddll_long_dqs_rank0_0_idx: u32_,
    pub emc_pmacro_ib_ddll_long_dqs_rank0_1_idx: u32_,
    pub emc_pmacro_ib_ddll_long_dqs_rank0_2_idx: u32_,
    pub emc_pmacro_ib_ddll_long_dqs_rank0_3_idx: u32_,
    pub emc_pmacro_ib_ddll_long_dqs_rank1_0_idx: u32_,
    pub emc_pmacro_ib_ddll_long_dqs_rank1_1_idx: u32_,
    pub emc_pmacro_ib_ddll_long_dqs_rank1_2_idx: u32_,
    pub emc_pmacro_ib_ddll_long_dqs_rank1_3_idx: u32_,
    pub emc_pmacro_ib_ddll_short_dq_rank0_byte0_0_idx: u32_,
    pub emc_pmacro_ib_ddll_short_dq_rank0_byte0_1_idx: u32_,
    pub emc_pmacro_ib_ddll_short_dq_rank0_byte0_2_idx: u32_,
    pub emc_pmacro_ib_ddll_short_dq_rank0_byte1_0_idx: u32_,
    pub emc_pmacro_ib_ddll_short_dq_rank0_byte1_1_idx: u32_,
    pub emc_pmacro_ib_ddll_short_dq_rank0_byte1_2_idx: u32_,
    pub emc_pmacro_ib_ddll_short_dq_rank0_byte2_0_idx: u32_,
    pub emc_pmacro_ib_ddll_short_dq_rank0_byte2_1_idx: u32_,
    pub emc_pmacro_ib_ddll_short_dq_rank0_byte2_2_idx: u32_,
    pub emc_pmacro_ib_ddll_short_dq_rank0_byte3_0_idx: u32_,
    pub emc_pmacro_ib_ddll_short_dq_rank0_byte3_1_idx: u32_,
    pub emc_pmacro_ib_ddll_short_dq_rank0_byte3_2_idx: u32_,
    pub emc_pmacro_ib_ddll_short_dq_rank0_byte4_0_idx: u32_,
    pub emc_pmacro_ib_ddll_short_dq_rank0_byte4_1_idx: u32_,
    pub emc_pmacro_ib_ddll_short_dq_rank0_byte4_2_idx: u32_,
    pub emc_pmacro_ib_ddll_short_dq_rank0_byte5_0_idx: u32_,
    pub emc_pmacro_ib_ddll_short_dq_rank0_byte5_1_idx: u32_,
    pub emc_pmacro_ib_ddll_short_dq_rank0_byte5_2_idx: u32_,
    pub emc_pmacro_ib_ddll_short_dq_rank0_byte6_0_idx: u32_,
    pub emc_pmacro_ib_ddll_short_dq_rank0_byte6_1_idx: u32_,
    pub emc_pmacro_ib_ddll_short_dq_rank0_byte6_2_idx: u32_,
    pub emc_pmacro_ib_ddll_short_dq_rank0_byte7_0_idx: u32_,
    pub emc_pmacro_ib_ddll_short_dq_rank0_byte7_1_idx: u32_,
    pub emc_pmacro_ib_ddll_short_dq_rank0_byte7_2_idx: u32_,
    pub emc_pmacro_ib_ddll_short_dq_rank1_byte0_0_idx: u32_,
    pub emc_pmacro_ib_ddll_short_dq_rank1_byte0_1_idx: u32_,
    pub emc_pmacro_ib_ddll_short_dq_rank1_byte0_2_idx: u32_,
    pub emc_pmacro_ib_ddll_short_dq_rank1_byte1_0_idx: u32_,
    pub emc_pmacro_ib_ddll_short_dq_rank1_byte1_1_idx: u32_,
    pub emc_pmacro_ib_ddll_short_dq_rank1_byte1_2_idx: u32_,
    pub emc_pmacro_ib_ddll_short_dq_rank1_byte2_0_idx: u32_,
    pub emc_pmacro_ib_ddll_short_dq_rank1_byte2_1_idx: u32_,
    pub emc_pmacro_ib_ddll_short_dq_rank1_byte2_2_idx: u32_,
    pub emc_pmacro_ib_ddll_short_dq_rank1_byte3_0_idx: u32_,
    pub emc_pmacro_ib_ddll_short_dq_rank1_byte3_1_idx: u32_,
    pub emc_pmacro_ib_ddll_short_dq_rank1_byte3_2_idx: u32_,
    pub emc_pmacro_ib_ddll_short_dq_rank1_byte4_0_idx: u32_,
    pub emc_pmacro_ib_ddll_short_dq_rank1_byte4_1_idx: u32_,
    pub emc_pmacro_ib_ddll_short_dq_rank1_byte4_2_idx: u32_,
    pub emc_pmacro_ib_ddll_short_dq_rank1_byte5_0_idx: u32_,
    pub emc_pmacro_ib_ddll_short_dq_rank1_byte5_1_idx: u32_,
    pub emc_pmacro_ib_ddll_short_dq_rank1_byte5_2_idx: u32_,
    pub emc_pmacro_ib_ddll_short_dq_rank1_byte6_0_idx: u32_,
    pub emc_pmacro_ib_ddll_short_dq_rank1_byte6_1_idx: u32_,
    pub emc_pmacro_ib_ddll_short_dq_rank1_byte6_2_idx: u32_,
    pub emc_pmacro_ib_ddll_short_dq_rank1_byte7_0_idx: u32_,
    pub emc_pmacro_ib_ddll_short_dq_rank1_byte7_1_idx: u32_,
    pub emc_pmacro_ib_ddll_short_dq_rank1_byte7_2_idx: u32_,
    pub emc_pmacro_ib_vref_dqs_0_idx: u32_,
    pub emc_pmacro_ib_vref_dqs_1_idx: u32_,
    pub emc_pmacro_ib_vref_dq_0_idx: u32_,
    pub emc_pmacro_ib_vref_dq_1_idx: u32_,
    pub emc_pmacro_ob_ddll_long_dq_rank0_0_idx: u32_,
    pub emc_pmacro_ob_ddll_long_dq_rank0_1_idx: u32_,
    pub emc_pmacro_ob_ddll_long_dq_rank0_2_idx: u32_,
    pub emc_pmacro_ob_ddll_long_dq_rank0_3_idx: u32_,
    pub emc_pmacro_ob_ddll_long_dq_rank0_4_idx: u32_,
    pub emc_pmacro_ob_ddll_long_dq_rank0_5_idx: u32_,
    pub emc_pmacro_ob_ddll_long_dq_rank1_0_idx: u32_,
    pub emc_pmacro_ob_ddll_long_dq_rank1_1_idx: u32_,
    pub emc_pmacro_ob_ddll_long_dq_rank1_2_idx: u32_,
    pub emc_pmacro_ob_ddll_long_dq_rank1_3_idx: u32_,
    pub emc_pmacro_ob_ddll_short_dq_rank0_byte0_0_idx: u32_,
    pub emc_pmacro_ob_ddll_short_dq_rank0_byte0_1_idx: u32_,
    pub emc_pmacro_ob_ddll_short_dq_rank0_byte0_2_idx: u32_,
    pub emc_pmacro_ob_ddll_short_dq_rank0_byte1_0_idx: u32_,
    pub emc_pmacro_ob_ddll_short_dq_rank0_byte1_1_idx: u32_,
    pub emc_pmacro_ob_ddll_short_dq_rank0_byte1_2_idx: u32_,
    pub emc_pmacro_ob_ddll_short_dq_rank0_byte2_0_idx: u32_,
    pub emc_pmacro_ob_ddll_short_dq_rank0_byte2_1_idx: u32_,
    pub emc_pmacro_ob_ddll_short_dq_rank0_byte2_2_idx: u32_,
    pub emc_pmacro_ob_ddll_short_dq_rank0_byte3_0_idx: u32_,
    pub emc_pmacro_ob_ddll_short_dq_rank0_byte3_1_idx: u32_,
    pub emc_pmacro_ob_ddll_short_dq_rank0_byte3_2_idx: u32_,
    pub emc_pmacro_ob_ddll_short_dq_rank0_byte4_0_idx: u32_,
    pub emc_pmacro_ob_ddll_short_dq_rank0_byte4_1_idx: u32_,
    pub emc_pmacro_ob_ddll_short_dq_rank0_byte4_2_idx: u32_,
    pub emc_pmacro_ob_ddll_short_dq_rank0_byte5_0_idx: u32_,
    pub emc_pmacro_ob_ddll_short_dq_rank0_byte5_1_idx: u32_,
    pub emc_pmacro_ob_ddll_short_dq_rank0_byte5_2_idx: u32_,
    pub emc_pmacro_ob_ddll_short_dq_rank0_byte6_0_idx: u32_,
    pub emc_pmacro_ob_ddll_short_dq_rank0_byte6_1_idx: u32_,
    pub emc_pmacro_ob_ddll_short_dq_rank0_byte6_2_idx: u32_,
    pub emc_pmacro_ob_ddll_short_dq_rank0_byte7_0_idx: u32_,
    pub emc_pmacro_ob_ddll_short_dq_rank0_byte7_1_idx: u32_,
    pub emc_pmacro_ob_ddll_short_dq_rank0_byte7_2_idx: u32_,
    pub emc_pmacro_ob_ddll_short_dq_rank0_cmd0_0_idx: u32_,
    pub emc_pmacro_ob_ddll_short_dq_rank0_cmd0_1_idx: u32_,
    pub emc_pmacro_ob_ddll_short_dq_rank0_cmd0_2_idx: u32_,
    pub emc_pmacro_ob_ddll_short_dq_rank0_cmd1_0_idx: u32_,
    pub emc_pmacro_ob_ddll_short_dq_rank0_cmd1_1_idx: u32_,
    pub emc_pmacro_ob_ddll_short_dq_rank0_cmd1_2_idx: u32_,
    pub emc_pmacro_ob_ddll_short_dq_rank0_cmd2_0_idx: u32_,
    pub emc_pmacro_ob_ddll_short_dq_rank0_cmd2_1_idx: u32_,
    pub emc_pmacro_ob_ddll_short_dq_rank0_cmd2_2_idx: u32_,
    pub emc_pmacro_ob_ddll_short_dq_rank0_cmd3_0_idx: u32_,
    pub emc_pmacro_ob_ddll_short_dq_rank0_cmd3_1_idx: u32_,
    pub emc_pmacro_ob_ddll_short_dq_rank0_cmd3_2_idx: u32_,
    pub emc_pmacro_ob_ddll_short_dq_rank1_byte0_0_idx: u32_,
    pub emc_pmacro_ob_ddll_short_dq_rank1_byte0_1_idx: u32_,
    pub emc_pmacro_ob_ddll_short_dq_rank1_byte0_2_idx: u32_,
    pub emc_pmacro_ob_ddll_short_dq_rank1_byte1_0_idx: u32_,
    pub emc_pmacro_ob_ddll_short_dq_rank1_byte1_1_idx: u32_,
    pub emc_pmacro_ob_ddll_short_dq_rank1_byte1_2_idx: u32_,
    pub emc_pmacro_ob_ddll_short_dq_rank1_byte2_0_idx: u32_,
    pub emc_pmacro_ob_ddll_short_dq_rank1_byte2_1_idx: u32_,
    pub emc_pmacro_ob_ddll_short_dq_rank1_byte2_2_idx: u32_,
    pub emc_pmacro_ob_ddll_short_dq_rank1_byte3_0_idx: u32_,
    pub emc_pmacro_ob_ddll_short_dq_rank1_byte3_1_idx: u32_,
    pub emc_pmacro_ob_ddll_short_dq_rank1_byte3_2_idx: u32_,
    pub emc_pmacro_ob_ddll_short_dq_rank1_byte4_0_idx: u32_,
    pub emc_pmacro_ob_ddll_short_dq_rank1_byte4_1_idx: u32_,
    pub emc_pmacro_ob_ddll_short_dq_rank1_byte4_2_idx: u32_,
    pub emc_pmacro_ob_ddll_short_dq_rank1_byte5_0_idx: u32_,
    pub emc_pmacro_ob_ddll_short_dq_rank1_byte5_1_idx: u32_,
    pub emc_pmacro_ob_ddll_short_dq_rank1_byte5_2_idx: u32_,
    pub emc_pmacro_ob_ddll_short_dq_rank1_byte6_0_idx: u32_,
    pub emc_pmacro_ob_ddll_short_dq_rank1_byte6_1_idx: u32_,
    pub emc_pmacro_ob_ddll_short_dq_rank1_byte6_2_idx: u32_,
    pub emc_pmacro_ob_ddll_short_dq_rank1_byte7_0_idx: u32_,
    pub emc_pmacro_ob_ddll_short_dq_rank1_byte7_1_idx: u32_,
    pub emc_pmacro_ob_ddll_short_dq_rank1_byte7_2_idx: u32_,
    pub emc_pmacro_quse_ddll_rank0_0_idx: u32_,
    pub emc_pmacro_quse_ddll_rank0_1_idx: u32_,
    pub emc_pmacro_quse_ddll_rank0_2_idx: u32_,
    pub emc_pmacro_quse_ddll_rank0_3_idx: u32_,
    pub emc_pmacro_quse_ddll_rank1_0_idx: u32_,
    pub emc_pmacro_quse_ddll_rank1_1_idx: u32_,
    pub emc_pmacro_quse_ddll_rank1_2_idx: u32_,
    pub emc_pmacro_quse_ddll_rank1_3_idx: u32_,
}
#[test]
fn bindgen_test_layout_trim_regs_t() {
    assert_eq!(
        ::core::mem::size_of::<trim_regs_t>(),
        552usize,
        concat!("Size of: ", stringify!(trim_regs_t))
    );
    assert_eq!(
        ::core::mem::align_of::<trim_regs_t>(),
        4usize,
        concat!("Alignment of ", stringify!(trim_regs_t))
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<trim_regs_t>())).emc_pmacro_ib_ddll_long_dqs_rank0_0_idx
                as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(trim_regs_t),
            "::",
            stringify!(emc_pmacro_ib_ddll_long_dqs_rank0_0_idx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<trim_regs_t>())).emc_pmacro_ib_ddll_long_dqs_rank0_1_idx
                as *const _ as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(trim_regs_t),
            "::",
            stringify!(emc_pmacro_ib_ddll_long_dqs_rank0_1_idx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<trim_regs_t>())).emc_pmacro_ib_ddll_long_dqs_rank0_2_idx
                as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(trim_regs_t),
            "::",
            stringify!(emc_pmacro_ib_ddll_long_dqs_rank0_2_idx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<trim_regs_t>())).emc_pmacro_ib_ddll_long_dqs_rank0_3_idx
                as *const _ as usize
        },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(trim_regs_t),
            "::",
            stringify!(emc_pmacro_ib_ddll_long_dqs_rank0_3_idx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<trim_regs_t>())).emc_pmacro_ib_ddll_long_dqs_rank1_0_idx
                as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(trim_regs_t),
            "::",
            stringify!(emc_pmacro_ib_ddll_long_dqs_rank1_0_idx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<trim_regs_t>())).emc_pmacro_ib_ddll_long_dqs_rank1_1_idx
                as *const _ as usize
        },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(trim_regs_t),
            "::",
            stringify!(emc_pmacro_ib_ddll_long_dqs_rank1_1_idx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<trim_regs_t>())).emc_pmacro_ib_ddll_long_dqs_rank1_2_idx
                as *const _ as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(trim_regs_t),
            "::",
            stringify!(emc_pmacro_ib_ddll_long_dqs_rank1_2_idx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<trim_regs_t>())).emc_pmacro_ib_ddll_long_dqs_rank1_3_idx
                as *const _ as usize
        },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(trim_regs_t),
            "::",
            stringify!(emc_pmacro_ib_ddll_long_dqs_rank1_3_idx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<trim_regs_t>())).emc_pmacro_ib_ddll_short_dq_rank0_byte0_0_idx
                as *const _ as usize
        },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(trim_regs_t),
            "::",
            stringify!(emc_pmacro_ib_ddll_short_dq_rank0_byte0_0_idx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<trim_regs_t>())).emc_pmacro_ib_ddll_short_dq_rank0_byte0_1_idx
                as *const _ as usize
        },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(trim_regs_t),
            "::",
            stringify!(emc_pmacro_ib_ddll_short_dq_rank0_byte0_1_idx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<trim_regs_t>())).emc_pmacro_ib_ddll_short_dq_rank0_byte0_2_idx
                as *const _ as usize
        },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(trim_regs_t),
            "::",
            stringify!(emc_pmacro_ib_ddll_short_dq_rank0_byte0_2_idx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<trim_regs_t>())).emc_pmacro_ib_ddll_short_dq_rank0_byte1_0_idx
                as *const _ as usize
        },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(trim_regs_t),
            "::",
            stringify!(emc_pmacro_ib_ddll_short_dq_rank0_byte1_0_idx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<trim_regs_t>())).emc_pmacro_ib_ddll_short_dq_rank0_byte1_1_idx
                as *const _ as usize
        },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(trim_regs_t),
            "::",
            stringify!(emc_pmacro_ib_ddll_short_dq_rank0_byte1_1_idx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<trim_regs_t>())).emc_pmacro_ib_ddll_short_dq_rank0_byte1_2_idx
                as *const _ as usize
        },
        52usize,
        concat!(
            "Offset of field: ",
            stringify!(trim_regs_t),
            "::",
            stringify!(emc_pmacro_ib_ddll_short_dq_rank0_byte1_2_idx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<trim_regs_t>())).emc_pmacro_ib_ddll_short_dq_rank0_byte2_0_idx
                as *const _ as usize
        },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(trim_regs_t),
            "::",
            stringify!(emc_pmacro_ib_ddll_short_dq_rank0_byte2_0_idx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<trim_regs_t>())).emc_pmacro_ib_ddll_short_dq_rank0_byte2_1_idx
                as *const _ as usize
        },
        60usize,
        concat!(
            "Offset of field: ",
            stringify!(trim_regs_t),
            "::",
            stringify!(emc_pmacro_ib_ddll_short_dq_rank0_byte2_1_idx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<trim_regs_t>())).emc_pmacro_ib_ddll_short_dq_rank0_byte2_2_idx
                as *const _ as usize
        },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(trim_regs_t),
            "::",
            stringify!(emc_pmacro_ib_ddll_short_dq_rank0_byte2_2_idx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<trim_regs_t>())).emc_pmacro_ib_ddll_short_dq_rank0_byte3_0_idx
                as *const _ as usize
        },
        68usize,
        concat!(
            "Offset of field: ",
            stringify!(trim_regs_t),
            "::",
            stringify!(emc_pmacro_ib_ddll_short_dq_rank0_byte3_0_idx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<trim_regs_t>())).emc_pmacro_ib_ddll_short_dq_rank0_byte3_1_idx
                as *const _ as usize
        },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(trim_regs_t),
            "::",
            stringify!(emc_pmacro_ib_ddll_short_dq_rank0_byte3_1_idx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<trim_regs_t>())).emc_pmacro_ib_ddll_short_dq_rank0_byte3_2_idx
                as *const _ as usize
        },
        76usize,
        concat!(
            "Offset of field: ",
            stringify!(trim_regs_t),
            "::",
            stringify!(emc_pmacro_ib_ddll_short_dq_rank0_byte3_2_idx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<trim_regs_t>())).emc_pmacro_ib_ddll_short_dq_rank0_byte4_0_idx
                as *const _ as usize
        },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(trim_regs_t),
            "::",
            stringify!(emc_pmacro_ib_ddll_short_dq_rank0_byte4_0_idx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<trim_regs_t>())).emc_pmacro_ib_ddll_short_dq_rank0_byte4_1_idx
                as *const _ as usize
        },
        84usize,
        concat!(
            "Offset of field: ",
            stringify!(trim_regs_t),
            "::",
            stringify!(emc_pmacro_ib_ddll_short_dq_rank0_byte4_1_idx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<trim_regs_t>())).emc_pmacro_ib_ddll_short_dq_rank0_byte4_2_idx
                as *const _ as usize
        },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(trim_regs_t),
            "::",
            stringify!(emc_pmacro_ib_ddll_short_dq_rank0_byte4_2_idx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<trim_regs_t>())).emc_pmacro_ib_ddll_short_dq_rank0_byte5_0_idx
                as *const _ as usize
        },
        92usize,
        concat!(
            "Offset of field: ",
            stringify!(trim_regs_t),
            "::",
            stringify!(emc_pmacro_ib_ddll_short_dq_rank0_byte5_0_idx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<trim_regs_t>())).emc_pmacro_ib_ddll_short_dq_rank0_byte5_1_idx
                as *const _ as usize
        },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(trim_regs_t),
            "::",
            stringify!(emc_pmacro_ib_ddll_short_dq_rank0_byte5_1_idx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<trim_regs_t>())).emc_pmacro_ib_ddll_short_dq_rank0_byte5_2_idx
                as *const _ as usize
        },
        100usize,
        concat!(
            "Offset of field: ",
            stringify!(trim_regs_t),
            "::",
            stringify!(emc_pmacro_ib_ddll_short_dq_rank0_byte5_2_idx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<trim_regs_t>())).emc_pmacro_ib_ddll_short_dq_rank0_byte6_0_idx
                as *const _ as usize
        },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(trim_regs_t),
            "::",
            stringify!(emc_pmacro_ib_ddll_short_dq_rank0_byte6_0_idx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<trim_regs_t>())).emc_pmacro_ib_ddll_short_dq_rank0_byte6_1_idx
                as *const _ as usize
        },
        108usize,
        concat!(
            "Offset of field: ",
            stringify!(trim_regs_t),
            "::",
            stringify!(emc_pmacro_ib_ddll_short_dq_rank0_byte6_1_idx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<trim_regs_t>())).emc_pmacro_ib_ddll_short_dq_rank0_byte6_2_idx
                as *const _ as usize
        },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(trim_regs_t),
            "::",
            stringify!(emc_pmacro_ib_ddll_short_dq_rank0_byte6_2_idx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<trim_regs_t>())).emc_pmacro_ib_ddll_short_dq_rank0_byte7_0_idx
                as *const _ as usize
        },
        116usize,
        concat!(
            "Offset of field: ",
            stringify!(trim_regs_t),
            "::",
            stringify!(emc_pmacro_ib_ddll_short_dq_rank0_byte7_0_idx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<trim_regs_t>())).emc_pmacro_ib_ddll_short_dq_rank0_byte7_1_idx
                as *const _ as usize
        },
        120usize,
        concat!(
            "Offset of field: ",
            stringify!(trim_regs_t),
            "::",
            stringify!(emc_pmacro_ib_ddll_short_dq_rank0_byte7_1_idx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<trim_regs_t>())).emc_pmacro_ib_ddll_short_dq_rank0_byte7_2_idx
                as *const _ as usize
        },
        124usize,
        concat!(
            "Offset of field: ",
            stringify!(trim_regs_t),
            "::",
            stringify!(emc_pmacro_ib_ddll_short_dq_rank0_byte7_2_idx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<trim_regs_t>())).emc_pmacro_ib_ddll_short_dq_rank1_byte0_0_idx
                as *const _ as usize
        },
        128usize,
        concat!(
            "Offset of field: ",
            stringify!(trim_regs_t),
            "::",
            stringify!(emc_pmacro_ib_ddll_short_dq_rank1_byte0_0_idx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<trim_regs_t>())).emc_pmacro_ib_ddll_short_dq_rank1_byte0_1_idx
                as *const _ as usize
        },
        132usize,
        concat!(
            "Offset of field: ",
            stringify!(trim_regs_t),
            "::",
            stringify!(emc_pmacro_ib_ddll_short_dq_rank1_byte0_1_idx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<trim_regs_t>())).emc_pmacro_ib_ddll_short_dq_rank1_byte0_2_idx
                as *const _ as usize
        },
        136usize,
        concat!(
            "Offset of field: ",
            stringify!(trim_regs_t),
            "::",
            stringify!(emc_pmacro_ib_ddll_short_dq_rank1_byte0_2_idx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<trim_regs_t>())).emc_pmacro_ib_ddll_short_dq_rank1_byte1_0_idx
                as *const _ as usize
        },
        140usize,
        concat!(
            "Offset of field: ",
            stringify!(trim_regs_t),
            "::",
            stringify!(emc_pmacro_ib_ddll_short_dq_rank1_byte1_0_idx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<trim_regs_t>())).emc_pmacro_ib_ddll_short_dq_rank1_byte1_1_idx
                as *const _ as usize
        },
        144usize,
        concat!(
            "Offset of field: ",
            stringify!(trim_regs_t),
            "::",
            stringify!(emc_pmacro_ib_ddll_short_dq_rank1_byte1_1_idx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<trim_regs_t>())).emc_pmacro_ib_ddll_short_dq_rank1_byte1_2_idx
                as *const _ as usize
        },
        148usize,
        concat!(
            "Offset of field: ",
            stringify!(trim_regs_t),
            "::",
            stringify!(emc_pmacro_ib_ddll_short_dq_rank1_byte1_2_idx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<trim_regs_t>())).emc_pmacro_ib_ddll_short_dq_rank1_byte2_0_idx
                as *const _ as usize
        },
        152usize,
        concat!(
            "Offset of field: ",
            stringify!(trim_regs_t),
            "::",
            stringify!(emc_pmacro_ib_ddll_short_dq_rank1_byte2_0_idx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<trim_regs_t>())).emc_pmacro_ib_ddll_short_dq_rank1_byte2_1_idx
                as *const _ as usize
        },
        156usize,
        concat!(
            "Offset of field: ",
            stringify!(trim_regs_t),
            "::",
            stringify!(emc_pmacro_ib_ddll_short_dq_rank1_byte2_1_idx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<trim_regs_t>())).emc_pmacro_ib_ddll_short_dq_rank1_byte2_2_idx
                as *const _ as usize
        },
        160usize,
        concat!(
            "Offset of field: ",
            stringify!(trim_regs_t),
            "::",
            stringify!(emc_pmacro_ib_ddll_short_dq_rank1_byte2_2_idx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<trim_regs_t>())).emc_pmacro_ib_ddll_short_dq_rank1_byte3_0_idx
                as *const _ as usize
        },
        164usize,
        concat!(
            "Offset of field: ",
            stringify!(trim_regs_t),
            "::",
            stringify!(emc_pmacro_ib_ddll_short_dq_rank1_byte3_0_idx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<trim_regs_t>())).emc_pmacro_ib_ddll_short_dq_rank1_byte3_1_idx
                as *const _ as usize
        },
        168usize,
        concat!(
            "Offset of field: ",
            stringify!(trim_regs_t),
            "::",
            stringify!(emc_pmacro_ib_ddll_short_dq_rank1_byte3_1_idx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<trim_regs_t>())).emc_pmacro_ib_ddll_short_dq_rank1_byte3_2_idx
                as *const _ as usize
        },
        172usize,
        concat!(
            "Offset of field: ",
            stringify!(trim_regs_t),
            "::",
            stringify!(emc_pmacro_ib_ddll_short_dq_rank1_byte3_2_idx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<trim_regs_t>())).emc_pmacro_ib_ddll_short_dq_rank1_byte4_0_idx
                as *const _ as usize
        },
        176usize,
        concat!(
            "Offset of field: ",
            stringify!(trim_regs_t),
            "::",
            stringify!(emc_pmacro_ib_ddll_short_dq_rank1_byte4_0_idx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<trim_regs_t>())).emc_pmacro_ib_ddll_short_dq_rank1_byte4_1_idx
                as *const _ as usize
        },
        180usize,
        concat!(
            "Offset of field: ",
            stringify!(trim_regs_t),
            "::",
            stringify!(emc_pmacro_ib_ddll_short_dq_rank1_byte4_1_idx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<trim_regs_t>())).emc_pmacro_ib_ddll_short_dq_rank1_byte4_2_idx
                as *const _ as usize
        },
        184usize,
        concat!(
            "Offset of field: ",
            stringify!(trim_regs_t),
            "::",
            stringify!(emc_pmacro_ib_ddll_short_dq_rank1_byte4_2_idx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<trim_regs_t>())).emc_pmacro_ib_ddll_short_dq_rank1_byte5_0_idx
                as *const _ as usize
        },
        188usize,
        concat!(
            "Offset of field: ",
            stringify!(trim_regs_t),
            "::",
            stringify!(emc_pmacro_ib_ddll_short_dq_rank1_byte5_0_idx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<trim_regs_t>())).emc_pmacro_ib_ddll_short_dq_rank1_byte5_1_idx
                as *const _ as usize
        },
        192usize,
        concat!(
            "Offset of field: ",
            stringify!(trim_regs_t),
            "::",
            stringify!(emc_pmacro_ib_ddll_short_dq_rank1_byte5_1_idx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<trim_regs_t>())).emc_pmacro_ib_ddll_short_dq_rank1_byte5_2_idx
                as *const _ as usize
        },
        196usize,
        concat!(
            "Offset of field: ",
            stringify!(trim_regs_t),
            "::",
            stringify!(emc_pmacro_ib_ddll_short_dq_rank1_byte5_2_idx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<trim_regs_t>())).emc_pmacro_ib_ddll_short_dq_rank1_byte6_0_idx
                as *const _ as usize
        },
        200usize,
        concat!(
            "Offset of field: ",
            stringify!(trim_regs_t),
            "::",
            stringify!(emc_pmacro_ib_ddll_short_dq_rank1_byte6_0_idx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<trim_regs_t>())).emc_pmacro_ib_ddll_short_dq_rank1_byte6_1_idx
                as *const _ as usize
        },
        204usize,
        concat!(
            "Offset of field: ",
            stringify!(trim_regs_t),
            "::",
            stringify!(emc_pmacro_ib_ddll_short_dq_rank1_byte6_1_idx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<trim_regs_t>())).emc_pmacro_ib_ddll_short_dq_rank1_byte6_2_idx
                as *const _ as usize
        },
        208usize,
        concat!(
            "Offset of field: ",
            stringify!(trim_regs_t),
            "::",
            stringify!(emc_pmacro_ib_ddll_short_dq_rank1_byte6_2_idx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<trim_regs_t>())).emc_pmacro_ib_ddll_short_dq_rank1_byte7_0_idx
                as *const _ as usize
        },
        212usize,
        concat!(
            "Offset of field: ",
            stringify!(trim_regs_t),
            "::",
            stringify!(emc_pmacro_ib_ddll_short_dq_rank1_byte7_0_idx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<trim_regs_t>())).emc_pmacro_ib_ddll_short_dq_rank1_byte7_1_idx
                as *const _ as usize
        },
        216usize,
        concat!(
            "Offset of field: ",
            stringify!(trim_regs_t),
            "::",
            stringify!(emc_pmacro_ib_ddll_short_dq_rank1_byte7_1_idx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<trim_regs_t>())).emc_pmacro_ib_ddll_short_dq_rank1_byte7_2_idx
                as *const _ as usize
        },
        220usize,
        concat!(
            "Offset of field: ",
            stringify!(trim_regs_t),
            "::",
            stringify!(emc_pmacro_ib_ddll_short_dq_rank1_byte7_2_idx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<trim_regs_t>())).emc_pmacro_ib_vref_dqs_0_idx as *const _
                as usize
        },
        224usize,
        concat!(
            "Offset of field: ",
            stringify!(trim_regs_t),
            "::",
            stringify!(emc_pmacro_ib_vref_dqs_0_idx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<trim_regs_t>())).emc_pmacro_ib_vref_dqs_1_idx as *const _
                as usize
        },
        228usize,
        concat!(
            "Offset of field: ",
            stringify!(trim_regs_t),
            "::",
            stringify!(emc_pmacro_ib_vref_dqs_1_idx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<trim_regs_t>())).emc_pmacro_ib_vref_dq_0_idx as *const _
                as usize
        },
        232usize,
        concat!(
            "Offset of field: ",
            stringify!(trim_regs_t),
            "::",
            stringify!(emc_pmacro_ib_vref_dq_0_idx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<trim_regs_t>())).emc_pmacro_ib_vref_dq_1_idx as *const _
                as usize
        },
        236usize,
        concat!(
            "Offset of field: ",
            stringify!(trim_regs_t),
            "::",
            stringify!(emc_pmacro_ib_vref_dq_1_idx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<trim_regs_t>())).emc_pmacro_ob_ddll_long_dq_rank0_0_idx
                as *const _ as usize
        },
        240usize,
        concat!(
            "Offset of field: ",
            stringify!(trim_regs_t),
            "::",
            stringify!(emc_pmacro_ob_ddll_long_dq_rank0_0_idx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<trim_regs_t>())).emc_pmacro_ob_ddll_long_dq_rank0_1_idx
                as *const _ as usize
        },
        244usize,
        concat!(
            "Offset of field: ",
            stringify!(trim_regs_t),
            "::",
            stringify!(emc_pmacro_ob_ddll_long_dq_rank0_1_idx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<trim_regs_t>())).emc_pmacro_ob_ddll_long_dq_rank0_2_idx
                as *const _ as usize
        },
        248usize,
        concat!(
            "Offset of field: ",
            stringify!(trim_regs_t),
            "::",
            stringify!(emc_pmacro_ob_ddll_long_dq_rank0_2_idx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<trim_regs_t>())).emc_pmacro_ob_ddll_long_dq_rank0_3_idx
                as *const _ as usize
        },
        252usize,
        concat!(
            "Offset of field: ",
            stringify!(trim_regs_t),
            "::",
            stringify!(emc_pmacro_ob_ddll_long_dq_rank0_3_idx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<trim_regs_t>())).emc_pmacro_ob_ddll_long_dq_rank0_4_idx
                as *const _ as usize
        },
        256usize,
        concat!(
            "Offset of field: ",
            stringify!(trim_regs_t),
            "::",
            stringify!(emc_pmacro_ob_ddll_long_dq_rank0_4_idx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<trim_regs_t>())).emc_pmacro_ob_ddll_long_dq_rank0_5_idx
                as *const _ as usize
        },
        260usize,
        concat!(
            "Offset of field: ",
            stringify!(trim_regs_t),
            "::",
            stringify!(emc_pmacro_ob_ddll_long_dq_rank0_5_idx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<trim_regs_t>())).emc_pmacro_ob_ddll_long_dq_rank1_0_idx
                as *const _ as usize
        },
        264usize,
        concat!(
            "Offset of field: ",
            stringify!(trim_regs_t),
            "::",
            stringify!(emc_pmacro_ob_ddll_long_dq_rank1_0_idx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<trim_regs_t>())).emc_pmacro_ob_ddll_long_dq_rank1_1_idx
                as *const _ as usize
        },
        268usize,
        concat!(
            "Offset of field: ",
            stringify!(trim_regs_t),
            "::",
            stringify!(emc_pmacro_ob_ddll_long_dq_rank1_1_idx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<trim_regs_t>())).emc_pmacro_ob_ddll_long_dq_rank1_2_idx
                as *const _ as usize
        },
        272usize,
        concat!(
            "Offset of field: ",
            stringify!(trim_regs_t),
            "::",
            stringify!(emc_pmacro_ob_ddll_long_dq_rank1_2_idx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<trim_regs_t>())).emc_pmacro_ob_ddll_long_dq_rank1_3_idx
                as *const _ as usize
        },
        276usize,
        concat!(
            "Offset of field: ",
            stringify!(trim_regs_t),
            "::",
            stringify!(emc_pmacro_ob_ddll_long_dq_rank1_3_idx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<trim_regs_t>())).emc_pmacro_ob_ddll_short_dq_rank0_byte0_0_idx
                as *const _ as usize
        },
        280usize,
        concat!(
            "Offset of field: ",
            stringify!(trim_regs_t),
            "::",
            stringify!(emc_pmacro_ob_ddll_short_dq_rank0_byte0_0_idx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<trim_regs_t>())).emc_pmacro_ob_ddll_short_dq_rank0_byte0_1_idx
                as *const _ as usize
        },
        284usize,
        concat!(
            "Offset of field: ",
            stringify!(trim_regs_t),
            "::",
            stringify!(emc_pmacro_ob_ddll_short_dq_rank0_byte0_1_idx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<trim_regs_t>())).emc_pmacro_ob_ddll_short_dq_rank0_byte0_2_idx
                as *const _ as usize
        },
        288usize,
        concat!(
            "Offset of field: ",
            stringify!(trim_regs_t),
            "::",
            stringify!(emc_pmacro_ob_ddll_short_dq_rank0_byte0_2_idx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<trim_regs_t>())).emc_pmacro_ob_ddll_short_dq_rank0_byte1_0_idx
                as *const _ as usize
        },
        292usize,
        concat!(
            "Offset of field: ",
            stringify!(trim_regs_t),
            "::",
            stringify!(emc_pmacro_ob_ddll_short_dq_rank0_byte1_0_idx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<trim_regs_t>())).emc_pmacro_ob_ddll_short_dq_rank0_byte1_1_idx
                as *const _ as usize
        },
        296usize,
        concat!(
            "Offset of field: ",
            stringify!(trim_regs_t),
            "::",
            stringify!(emc_pmacro_ob_ddll_short_dq_rank0_byte1_1_idx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<trim_regs_t>())).emc_pmacro_ob_ddll_short_dq_rank0_byte1_2_idx
                as *const _ as usize
        },
        300usize,
        concat!(
            "Offset of field: ",
            stringify!(trim_regs_t),
            "::",
            stringify!(emc_pmacro_ob_ddll_short_dq_rank0_byte1_2_idx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<trim_regs_t>())).emc_pmacro_ob_ddll_short_dq_rank0_byte2_0_idx
                as *const _ as usize
        },
        304usize,
        concat!(
            "Offset of field: ",
            stringify!(trim_regs_t),
            "::",
            stringify!(emc_pmacro_ob_ddll_short_dq_rank0_byte2_0_idx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<trim_regs_t>())).emc_pmacro_ob_ddll_short_dq_rank0_byte2_1_idx
                as *const _ as usize
        },
        308usize,
        concat!(
            "Offset of field: ",
            stringify!(trim_regs_t),
            "::",
            stringify!(emc_pmacro_ob_ddll_short_dq_rank0_byte2_1_idx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<trim_regs_t>())).emc_pmacro_ob_ddll_short_dq_rank0_byte2_2_idx
                as *const _ as usize
        },
        312usize,
        concat!(
            "Offset of field: ",
            stringify!(trim_regs_t),
            "::",
            stringify!(emc_pmacro_ob_ddll_short_dq_rank0_byte2_2_idx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<trim_regs_t>())).emc_pmacro_ob_ddll_short_dq_rank0_byte3_0_idx
                as *const _ as usize
        },
        316usize,
        concat!(
            "Offset of field: ",
            stringify!(trim_regs_t),
            "::",
            stringify!(emc_pmacro_ob_ddll_short_dq_rank0_byte3_0_idx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<trim_regs_t>())).emc_pmacro_ob_ddll_short_dq_rank0_byte3_1_idx
                as *const _ as usize
        },
        320usize,
        concat!(
            "Offset of field: ",
            stringify!(trim_regs_t),
            "::",
            stringify!(emc_pmacro_ob_ddll_short_dq_rank0_byte3_1_idx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<trim_regs_t>())).emc_pmacro_ob_ddll_short_dq_rank0_byte3_2_idx
                as *const _ as usize
        },
        324usize,
        concat!(
            "Offset of field: ",
            stringify!(trim_regs_t),
            "::",
            stringify!(emc_pmacro_ob_ddll_short_dq_rank0_byte3_2_idx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<trim_regs_t>())).emc_pmacro_ob_ddll_short_dq_rank0_byte4_0_idx
                as *const _ as usize
        },
        328usize,
        concat!(
            "Offset of field: ",
            stringify!(trim_regs_t),
            "::",
            stringify!(emc_pmacro_ob_ddll_short_dq_rank0_byte4_0_idx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<trim_regs_t>())).emc_pmacro_ob_ddll_short_dq_rank0_byte4_1_idx
                as *const _ as usize
        },
        332usize,
        concat!(
            "Offset of field: ",
            stringify!(trim_regs_t),
            "::",
            stringify!(emc_pmacro_ob_ddll_short_dq_rank0_byte4_1_idx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<trim_regs_t>())).emc_pmacro_ob_ddll_short_dq_rank0_byte4_2_idx
                as *const _ as usize
        },
        336usize,
        concat!(
            "Offset of field: ",
            stringify!(trim_regs_t),
            "::",
            stringify!(emc_pmacro_ob_ddll_short_dq_rank0_byte4_2_idx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<trim_regs_t>())).emc_pmacro_ob_ddll_short_dq_rank0_byte5_0_idx
                as *const _ as usize
        },
        340usize,
        concat!(
            "Offset of field: ",
            stringify!(trim_regs_t),
            "::",
            stringify!(emc_pmacro_ob_ddll_short_dq_rank0_byte5_0_idx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<trim_regs_t>())).emc_pmacro_ob_ddll_short_dq_rank0_byte5_1_idx
                as *const _ as usize
        },
        344usize,
        concat!(
            "Offset of field: ",
            stringify!(trim_regs_t),
            "::",
            stringify!(emc_pmacro_ob_ddll_short_dq_rank0_byte5_1_idx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<trim_regs_t>())).emc_pmacro_ob_ddll_short_dq_rank0_byte5_2_idx
                as *const _ as usize
        },
        348usize,
        concat!(
            "Offset of field: ",
            stringify!(trim_regs_t),
            "::",
            stringify!(emc_pmacro_ob_ddll_short_dq_rank0_byte5_2_idx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<trim_regs_t>())).emc_pmacro_ob_ddll_short_dq_rank0_byte6_0_idx
                as *const _ as usize
        },
        352usize,
        concat!(
            "Offset of field: ",
            stringify!(trim_regs_t),
            "::",
            stringify!(emc_pmacro_ob_ddll_short_dq_rank0_byte6_0_idx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<trim_regs_t>())).emc_pmacro_ob_ddll_short_dq_rank0_byte6_1_idx
                as *const _ as usize
        },
        356usize,
        concat!(
            "Offset of field: ",
            stringify!(trim_regs_t),
            "::",
            stringify!(emc_pmacro_ob_ddll_short_dq_rank0_byte6_1_idx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<trim_regs_t>())).emc_pmacro_ob_ddll_short_dq_rank0_byte6_2_idx
                as *const _ as usize
        },
        360usize,
        concat!(
            "Offset of field: ",
            stringify!(trim_regs_t),
            "::",
            stringify!(emc_pmacro_ob_ddll_short_dq_rank0_byte6_2_idx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<trim_regs_t>())).emc_pmacro_ob_ddll_short_dq_rank0_byte7_0_idx
                as *const _ as usize
        },
        364usize,
        concat!(
            "Offset of field: ",
            stringify!(trim_regs_t),
            "::",
            stringify!(emc_pmacro_ob_ddll_short_dq_rank0_byte7_0_idx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<trim_regs_t>())).emc_pmacro_ob_ddll_short_dq_rank0_byte7_1_idx
                as *const _ as usize
        },
        368usize,
        concat!(
            "Offset of field: ",
            stringify!(trim_regs_t),
            "::",
            stringify!(emc_pmacro_ob_ddll_short_dq_rank0_byte7_1_idx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<trim_regs_t>())).emc_pmacro_ob_ddll_short_dq_rank0_byte7_2_idx
                as *const _ as usize
        },
        372usize,
        concat!(
            "Offset of field: ",
            stringify!(trim_regs_t),
            "::",
            stringify!(emc_pmacro_ob_ddll_short_dq_rank0_byte7_2_idx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<trim_regs_t>())).emc_pmacro_ob_ddll_short_dq_rank0_cmd0_0_idx
                as *const _ as usize
        },
        376usize,
        concat!(
            "Offset of field: ",
            stringify!(trim_regs_t),
            "::",
            stringify!(emc_pmacro_ob_ddll_short_dq_rank0_cmd0_0_idx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<trim_regs_t>())).emc_pmacro_ob_ddll_short_dq_rank0_cmd0_1_idx
                as *const _ as usize
        },
        380usize,
        concat!(
            "Offset of field: ",
            stringify!(trim_regs_t),
            "::",
            stringify!(emc_pmacro_ob_ddll_short_dq_rank0_cmd0_1_idx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<trim_regs_t>())).emc_pmacro_ob_ddll_short_dq_rank0_cmd0_2_idx
                as *const _ as usize
        },
        384usize,
        concat!(
            "Offset of field: ",
            stringify!(trim_regs_t),
            "::",
            stringify!(emc_pmacro_ob_ddll_short_dq_rank0_cmd0_2_idx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<trim_regs_t>())).emc_pmacro_ob_ddll_short_dq_rank0_cmd1_0_idx
                as *const _ as usize
        },
        388usize,
        concat!(
            "Offset of field: ",
            stringify!(trim_regs_t),
            "::",
            stringify!(emc_pmacro_ob_ddll_short_dq_rank0_cmd1_0_idx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<trim_regs_t>())).emc_pmacro_ob_ddll_short_dq_rank0_cmd1_1_idx
                as *const _ as usize
        },
        392usize,
        concat!(
            "Offset of field: ",
            stringify!(trim_regs_t),
            "::",
            stringify!(emc_pmacro_ob_ddll_short_dq_rank0_cmd1_1_idx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<trim_regs_t>())).emc_pmacro_ob_ddll_short_dq_rank0_cmd1_2_idx
                as *const _ as usize
        },
        396usize,
        concat!(
            "Offset of field: ",
            stringify!(trim_regs_t),
            "::",
            stringify!(emc_pmacro_ob_ddll_short_dq_rank0_cmd1_2_idx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<trim_regs_t>())).emc_pmacro_ob_ddll_short_dq_rank0_cmd2_0_idx
                as *const _ as usize
        },
        400usize,
        concat!(
            "Offset of field: ",
            stringify!(trim_regs_t),
            "::",
            stringify!(emc_pmacro_ob_ddll_short_dq_rank0_cmd2_0_idx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<trim_regs_t>())).emc_pmacro_ob_ddll_short_dq_rank0_cmd2_1_idx
                as *const _ as usize
        },
        404usize,
        concat!(
            "Offset of field: ",
            stringify!(trim_regs_t),
            "::",
            stringify!(emc_pmacro_ob_ddll_short_dq_rank0_cmd2_1_idx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<trim_regs_t>())).emc_pmacro_ob_ddll_short_dq_rank0_cmd2_2_idx
                as *const _ as usize
        },
        408usize,
        concat!(
            "Offset of field: ",
            stringify!(trim_regs_t),
            "::",
            stringify!(emc_pmacro_ob_ddll_short_dq_rank0_cmd2_2_idx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<trim_regs_t>())).emc_pmacro_ob_ddll_short_dq_rank0_cmd3_0_idx
                as *const _ as usize
        },
        412usize,
        concat!(
            "Offset of field: ",
            stringify!(trim_regs_t),
            "::",
            stringify!(emc_pmacro_ob_ddll_short_dq_rank0_cmd3_0_idx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<trim_regs_t>())).emc_pmacro_ob_ddll_short_dq_rank0_cmd3_1_idx
                as *const _ as usize
        },
        416usize,
        concat!(
            "Offset of field: ",
            stringify!(trim_regs_t),
            "::",
            stringify!(emc_pmacro_ob_ddll_short_dq_rank0_cmd3_1_idx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<trim_regs_t>())).emc_pmacro_ob_ddll_short_dq_rank0_cmd3_2_idx
                as *const _ as usize
        },
        420usize,
        concat!(
            "Offset of field: ",
            stringify!(trim_regs_t),
            "::",
            stringify!(emc_pmacro_ob_ddll_short_dq_rank0_cmd3_2_idx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<trim_regs_t>())).emc_pmacro_ob_ddll_short_dq_rank1_byte0_0_idx
                as *const _ as usize
        },
        424usize,
        concat!(
            "Offset of field: ",
            stringify!(trim_regs_t),
            "::",
            stringify!(emc_pmacro_ob_ddll_short_dq_rank1_byte0_0_idx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<trim_regs_t>())).emc_pmacro_ob_ddll_short_dq_rank1_byte0_1_idx
                as *const _ as usize
        },
        428usize,
        concat!(
            "Offset of field: ",
            stringify!(trim_regs_t),
            "::",
            stringify!(emc_pmacro_ob_ddll_short_dq_rank1_byte0_1_idx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<trim_regs_t>())).emc_pmacro_ob_ddll_short_dq_rank1_byte0_2_idx
                as *const _ as usize
        },
        432usize,
        concat!(
            "Offset of field: ",
            stringify!(trim_regs_t),
            "::",
            stringify!(emc_pmacro_ob_ddll_short_dq_rank1_byte0_2_idx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<trim_regs_t>())).emc_pmacro_ob_ddll_short_dq_rank1_byte1_0_idx
                as *const _ as usize
        },
        436usize,
        concat!(
            "Offset of field: ",
            stringify!(trim_regs_t),
            "::",
            stringify!(emc_pmacro_ob_ddll_short_dq_rank1_byte1_0_idx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<trim_regs_t>())).emc_pmacro_ob_ddll_short_dq_rank1_byte1_1_idx
                as *const _ as usize
        },
        440usize,
        concat!(
            "Offset of field: ",
            stringify!(trim_regs_t),
            "::",
            stringify!(emc_pmacro_ob_ddll_short_dq_rank1_byte1_1_idx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<trim_regs_t>())).emc_pmacro_ob_ddll_short_dq_rank1_byte1_2_idx
                as *const _ as usize
        },
        444usize,
        concat!(
            "Offset of field: ",
            stringify!(trim_regs_t),
            "::",
            stringify!(emc_pmacro_ob_ddll_short_dq_rank1_byte1_2_idx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<trim_regs_t>())).emc_pmacro_ob_ddll_short_dq_rank1_byte2_0_idx
                as *const _ as usize
        },
        448usize,
        concat!(
            "Offset of field: ",
            stringify!(trim_regs_t),
            "::",
            stringify!(emc_pmacro_ob_ddll_short_dq_rank1_byte2_0_idx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<trim_regs_t>())).emc_pmacro_ob_ddll_short_dq_rank1_byte2_1_idx
                as *const _ as usize
        },
        452usize,
        concat!(
            "Offset of field: ",
            stringify!(trim_regs_t),
            "::",
            stringify!(emc_pmacro_ob_ddll_short_dq_rank1_byte2_1_idx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<trim_regs_t>())).emc_pmacro_ob_ddll_short_dq_rank1_byte2_2_idx
                as *const _ as usize
        },
        456usize,
        concat!(
            "Offset of field: ",
            stringify!(trim_regs_t),
            "::",
            stringify!(emc_pmacro_ob_ddll_short_dq_rank1_byte2_2_idx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<trim_regs_t>())).emc_pmacro_ob_ddll_short_dq_rank1_byte3_0_idx
                as *const _ as usize
        },
        460usize,
        concat!(
            "Offset of field: ",
            stringify!(trim_regs_t),
            "::",
            stringify!(emc_pmacro_ob_ddll_short_dq_rank1_byte3_0_idx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<trim_regs_t>())).emc_pmacro_ob_ddll_short_dq_rank1_byte3_1_idx
                as *const _ as usize
        },
        464usize,
        concat!(
            "Offset of field: ",
            stringify!(trim_regs_t),
            "::",
            stringify!(emc_pmacro_ob_ddll_short_dq_rank1_byte3_1_idx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<trim_regs_t>())).emc_pmacro_ob_ddll_short_dq_rank1_byte3_2_idx
                as *const _ as usize
        },
        468usize,
        concat!(
            "Offset of field: ",
            stringify!(trim_regs_t),
            "::",
            stringify!(emc_pmacro_ob_ddll_short_dq_rank1_byte3_2_idx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<trim_regs_t>())).emc_pmacro_ob_ddll_short_dq_rank1_byte4_0_idx
                as *const _ as usize
        },
        472usize,
        concat!(
            "Offset of field: ",
            stringify!(trim_regs_t),
            "::",
            stringify!(emc_pmacro_ob_ddll_short_dq_rank1_byte4_0_idx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<trim_regs_t>())).emc_pmacro_ob_ddll_short_dq_rank1_byte4_1_idx
                as *const _ as usize
        },
        476usize,
        concat!(
            "Offset of field: ",
            stringify!(trim_regs_t),
            "::",
            stringify!(emc_pmacro_ob_ddll_short_dq_rank1_byte4_1_idx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<trim_regs_t>())).emc_pmacro_ob_ddll_short_dq_rank1_byte4_2_idx
                as *const _ as usize
        },
        480usize,
        concat!(
            "Offset of field: ",
            stringify!(trim_regs_t),
            "::",
            stringify!(emc_pmacro_ob_ddll_short_dq_rank1_byte4_2_idx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<trim_regs_t>())).emc_pmacro_ob_ddll_short_dq_rank1_byte5_0_idx
                as *const _ as usize
        },
        484usize,
        concat!(
            "Offset of field: ",
            stringify!(trim_regs_t),
            "::",
            stringify!(emc_pmacro_ob_ddll_short_dq_rank1_byte5_0_idx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<trim_regs_t>())).emc_pmacro_ob_ddll_short_dq_rank1_byte5_1_idx
                as *const _ as usize
        },
        488usize,
        concat!(
            "Offset of field: ",
            stringify!(trim_regs_t),
            "::",
            stringify!(emc_pmacro_ob_ddll_short_dq_rank1_byte5_1_idx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<trim_regs_t>())).emc_pmacro_ob_ddll_short_dq_rank1_byte5_2_idx
                as *const _ as usize
        },
        492usize,
        concat!(
            "Offset of field: ",
            stringify!(trim_regs_t),
            "::",
            stringify!(emc_pmacro_ob_ddll_short_dq_rank1_byte5_2_idx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<trim_regs_t>())).emc_pmacro_ob_ddll_short_dq_rank1_byte6_0_idx
                as *const _ as usize
        },
        496usize,
        concat!(
            "Offset of field: ",
            stringify!(trim_regs_t),
            "::",
            stringify!(emc_pmacro_ob_ddll_short_dq_rank1_byte6_0_idx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<trim_regs_t>())).emc_pmacro_ob_ddll_short_dq_rank1_byte6_1_idx
                as *const _ as usize
        },
        500usize,
        concat!(
            "Offset of field: ",
            stringify!(trim_regs_t),
            "::",
            stringify!(emc_pmacro_ob_ddll_short_dq_rank1_byte6_1_idx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<trim_regs_t>())).emc_pmacro_ob_ddll_short_dq_rank1_byte6_2_idx
                as *const _ as usize
        },
        504usize,
        concat!(
            "Offset of field: ",
            stringify!(trim_regs_t),
            "::",
            stringify!(emc_pmacro_ob_ddll_short_dq_rank1_byte6_2_idx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<trim_regs_t>())).emc_pmacro_ob_ddll_short_dq_rank1_byte7_0_idx
                as *const _ as usize
        },
        508usize,
        concat!(
            "Offset of field: ",
            stringify!(trim_regs_t),
            "::",
            stringify!(emc_pmacro_ob_ddll_short_dq_rank1_byte7_0_idx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<trim_regs_t>())).emc_pmacro_ob_ddll_short_dq_rank1_byte7_1_idx
                as *const _ as usize
        },
        512usize,
        concat!(
            "Offset of field: ",
            stringify!(trim_regs_t),
            "::",
            stringify!(emc_pmacro_ob_ddll_short_dq_rank1_byte7_1_idx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<trim_regs_t>())).emc_pmacro_ob_ddll_short_dq_rank1_byte7_2_idx
                as *const _ as usize
        },
        516usize,
        concat!(
            "Offset of field: ",
            stringify!(trim_regs_t),
            "::",
            stringify!(emc_pmacro_ob_ddll_short_dq_rank1_byte7_2_idx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<trim_regs_t>())).emc_pmacro_quse_ddll_rank0_0_idx as *const _
                as usize
        },
        520usize,
        concat!(
            "Offset of field: ",
            stringify!(trim_regs_t),
            "::",
            stringify!(emc_pmacro_quse_ddll_rank0_0_idx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<trim_regs_t>())).emc_pmacro_quse_ddll_rank0_1_idx as *const _
                as usize
        },
        524usize,
        concat!(
            "Offset of field: ",
            stringify!(trim_regs_t),
            "::",
            stringify!(emc_pmacro_quse_ddll_rank0_1_idx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<trim_regs_t>())).emc_pmacro_quse_ddll_rank0_2_idx as *const _
                as usize
        },
        528usize,
        concat!(
            "Offset of field: ",
            stringify!(trim_regs_t),
            "::",
            stringify!(emc_pmacro_quse_ddll_rank0_2_idx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<trim_regs_t>())).emc_pmacro_quse_ddll_rank0_3_idx as *const _
                as usize
        },
        532usize,
        concat!(
            "Offset of field: ",
            stringify!(trim_regs_t),
            "::",
            stringify!(emc_pmacro_quse_ddll_rank0_3_idx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<trim_regs_t>())).emc_pmacro_quse_ddll_rank1_0_idx as *const _
                as usize
        },
        536usize,
        concat!(
            "Offset of field: ",
            stringify!(trim_regs_t),
            "::",
            stringify!(emc_pmacro_quse_ddll_rank1_0_idx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<trim_regs_t>())).emc_pmacro_quse_ddll_rank1_1_idx as *const _
                as usize
        },
        540usize,
        concat!(
            "Offset of field: ",
            stringify!(trim_regs_t),
            "::",
            stringify!(emc_pmacro_quse_ddll_rank1_1_idx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<trim_regs_t>())).emc_pmacro_quse_ddll_rank1_2_idx as *const _
                as usize
        },
        544usize,
        concat!(
            "Offset of field: ",
            stringify!(trim_regs_t),
            "::",
            stringify!(emc_pmacro_quse_ddll_rank1_2_idx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<trim_regs_t>())).emc_pmacro_quse_ddll_rank1_3_idx as *const _
                as usize
        },
        548usize,
        concat!(
            "Offset of field: ",
            stringify!(trim_regs_t),
            "::",
            stringify!(emc_pmacro_quse_ddll_rank1_3_idx)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct trim_perch_regs_t {
    pub emc_cmd_brlshft_0_idx: u32_,
    pub emc_cmd_brlshft_1_idx: u32_,
    pub emc0_data_brlshft_0_idx: u32_,
    pub emc1_data_brlshft_0_idx: u32_,
    pub emc0_data_brlshft_1_idx: u32_,
    pub emc1_data_brlshft_1_idx: u32_,
    pub emc_quse_brlshft_0_idx: u32_,
    pub emc_quse_brlshft_1_idx: u32_,
    pub emc_quse_brlshft_2_idx: u32_,
    pub emc_quse_brlshft_3_idx: u32_,
}
#[test]
fn bindgen_test_layout_trim_perch_regs_t() {
    assert_eq!(
        ::core::mem::size_of::<trim_perch_regs_t>(),
        40usize,
        concat!("Size of: ", stringify!(trim_perch_regs_t))
    );
    assert_eq!(
        ::core::mem::align_of::<trim_perch_regs_t>(),
        4usize,
        concat!("Alignment of ", stringify!(trim_perch_regs_t))
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<trim_perch_regs_t>())).emc_cmd_brlshft_0_idx as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(trim_perch_regs_t),
            "::",
            stringify!(emc_cmd_brlshft_0_idx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<trim_perch_regs_t>())).emc_cmd_brlshft_1_idx as *const _
                as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(trim_perch_regs_t),
            "::",
            stringify!(emc_cmd_brlshft_1_idx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<trim_perch_regs_t>())).emc0_data_brlshft_0_idx as *const _
                as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(trim_perch_regs_t),
            "::",
            stringify!(emc0_data_brlshft_0_idx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<trim_perch_regs_t>())).emc1_data_brlshft_0_idx as *const _
                as usize
        },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(trim_perch_regs_t),
            "::",
            stringify!(emc1_data_brlshft_0_idx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<trim_perch_regs_t>())).emc0_data_brlshft_1_idx as *const _
                as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(trim_perch_regs_t),
            "::",
            stringify!(emc0_data_brlshft_1_idx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<trim_perch_regs_t>())).emc1_data_brlshft_1_idx as *const _
                as usize
        },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(trim_perch_regs_t),
            "::",
            stringify!(emc1_data_brlshft_1_idx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<trim_perch_regs_t>())).emc_quse_brlshft_0_idx as *const _
                as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(trim_perch_regs_t),
            "::",
            stringify!(emc_quse_brlshft_0_idx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<trim_perch_regs_t>())).emc_quse_brlshft_1_idx as *const _
                as usize
        },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(trim_perch_regs_t),
            "::",
            stringify!(emc_quse_brlshft_1_idx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<trim_perch_regs_t>())).emc_quse_brlshft_2_idx as *const _
                as usize
        },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(trim_perch_regs_t),
            "::",
            stringify!(emc_quse_brlshft_2_idx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<trim_perch_regs_t>())).emc_quse_brlshft_3_idx as *const _
                as usize
        },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(trim_perch_regs_t),
            "::",
            stringify!(emc_quse_brlshft_3_idx)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct dram_timings_t {
    pub t_rp: u32_,
    pub t_fc_lpddr4: u32_,
    pub t_rfc: u32_,
    pub t_pdex: u32_,
    pub rl: u32_,
}
#[test]
fn bindgen_test_layout_dram_timings_t() {
    assert_eq!(
        ::core::mem::size_of::<dram_timings_t>(),
        20usize,
        concat!("Size of: ", stringify!(dram_timings_t))
    );
    assert_eq!(
        ::core::mem::align_of::<dram_timings_t>(),
        4usize,
        concat!("Alignment of ", stringify!(dram_timings_t))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<dram_timings_t>())).t_rp as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(dram_timings_t),
            "::",
            stringify!(t_rp)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<dram_timings_t>())).t_fc_lpddr4 as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(dram_timings_t),
            "::",
            stringify!(t_fc_lpddr4)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<dram_timings_t>())).t_rfc as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(dram_timings_t),
            "::",
            stringify!(t_rfc)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<dram_timings_t>())).t_pdex as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(dram_timings_t),
            "::",
            stringify!(t_pdex)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<dram_timings_t>())).rl as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(dram_timings_t),
            "::",
            stringify!(rl)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct vref_perch_regs_t {
    pub emc0_training_opt_dqs_ib_vref_rank0_idx: u32_,
    pub emc1_training_opt_dqs_ib_vref_rank0_idx: u32_,
    pub emc0_training_opt_dqs_ib_vref_rank1_idx: u32_,
    pub emc1_training_opt_dqs_ib_vref_rank1_idx: u32_,
}
#[test]
fn bindgen_test_layout_vref_perch_regs_t() {
    assert_eq!(
        ::core::mem::size_of::<vref_perch_regs_t>(),
        16usize,
        concat!("Size of: ", stringify!(vref_perch_regs_t))
    );
    assert_eq!(
        ::core::mem::align_of::<vref_perch_regs_t>(),
        4usize,
        concat!("Alignment of ", stringify!(vref_perch_regs_t))
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<vref_perch_regs_t>())).emc0_training_opt_dqs_ib_vref_rank0_idx
                as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(vref_perch_regs_t),
            "::",
            stringify!(emc0_training_opt_dqs_ib_vref_rank0_idx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<vref_perch_regs_t>())).emc1_training_opt_dqs_ib_vref_rank0_idx
                as *const _ as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(vref_perch_regs_t),
            "::",
            stringify!(emc1_training_opt_dqs_ib_vref_rank0_idx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<vref_perch_regs_t>())).emc0_training_opt_dqs_ib_vref_rank1_idx
                as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(vref_perch_regs_t),
            "::",
            stringify!(emc0_training_opt_dqs_ib_vref_rank1_idx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<vref_perch_regs_t>())).emc1_training_opt_dqs_ib_vref_rank1_idx
                as *const _ as usize
        },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(vref_perch_regs_t),
            "::",
            stringify!(emc1_training_opt_dqs_ib_vref_rank1_idx)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct emc_table_t {
    pub rev: u32_,
    pub dvfs_ver: [cty::c_char; 60usize],
    pub rate_khz: u32_,
    pub min_volt: u32_,
    pub gpu_min_volt: u32_,
    pub clock_src: [cty::c_char; 32usize],
    pub clk_src_emc: u32_,
    pub needs_training: u32_,
    pub training_pattern: u32_,
    pub trained: u32_,
    pub periodic_training: u32_,
    pub trained_dram_clktree_c0d0u0: u32_,
    pub trained_dram_clktree_c0d0u1: u32_,
    pub trained_dram_clktree_c0d1u0: u32_,
    pub trained_dram_clktree_c0d1u1: u32_,
    pub trained_dram_clktree_c1d0u0: u32_,
    pub trained_dram_clktree_c1d0u1: u32_,
    pub trained_dram_clktree_c1d1u0: u32_,
    pub trained_dram_clktree_c1d1u1: u32_,
    pub current_dram_clktree_c0d0u0: u32_,
    pub current_dram_clktree_c0d0u1: u32_,
    pub current_dram_clktree_c0d1u0: u32_,
    pub current_dram_clktree_c0d1u1: u32_,
    pub current_dram_clktree_c1d0u0: u32_,
    pub current_dram_clktree_c1d0u1: u32_,
    pub current_dram_clktree_c1d1u0: u32_,
    pub current_dram_clktree_c1d1u1: u32_,
    pub run_clocks: u32_,
    pub tree_margin: u32_,
    pub num_burst: u32_,
    pub num_burst_per_ch: u32_,
    pub num_trim: u32_,
    pub num_trim_per_ch: u32_,
    pub num_mc_regs: u32_,
    pub num_up_down: u32_,
    pub vref_num: u32_,
    pub training_mod_num: u32_,
    pub dram_timing_num: u32_,
    pub ptfv_list: ptfv_list_table_t,
    pub burst_regs: burst_regs_t,
    pub burst_reg_per_ch: burst_reg_per_ch_t,
    pub shadow_regs_ca_train: burst_regs_t,
    pub shadow_regs_quse_train: burst_regs_t,
    pub shadow_regs_rdwr_train: burst_regs_t,
    pub trim_regs: trim_regs_t,
    pub trim_perch_regs: trim_perch_regs_t,
    pub vref_perch_regs: vref_perch_regs_t,
    pub dram_timings: dram_timings_t,
    pub training_mod_regs: [u32_; 20usize],
    pub save_restore_mod_regs: [u32_; 12usize],
    pub burst_mc_regs: [u32_; 33usize],
    pub la_scale_regs: [u32_; 24usize],
    pub min_mrs_wait: u32_,
    pub emc_mrw: u32_,
    pub emc_mrw2: u32_,
    pub emc_mrw3: u32_,
    pub emc_mrw4: u32_,
    pub emc_mrw9: u32_,
    pub emc_mrs: u32_,
    pub emc_emrs: u32_,
    pub emc_emrs2: u32_,
    pub emc_auto_cal_config: u32_,
    pub emc_auto_cal_config2: u32_,
    pub emc_auto_cal_config3: u32_,
    pub emc_auto_cal_config4: u32_,
    pub emc_auto_cal_config5: u32_,
    pub emc_auto_cal_config6: u32_,
    pub emc_auto_cal_config7: u32_,
    pub emc_auto_cal_config8: u32_,
    pub emc_cfg_2: u32_,
    pub emc_sel_dpd_ctrl: u32_,
    pub emc_fdpd_ctrl_cmd_no_ramp: u32_,
    pub dll_clk_src: u32_,
    pub clk_out_enb_x_0_clk_enb_emc_dll: u32_,
    pub latency: u32_,
}
#[test]
fn bindgen_test_layout_emc_table_t() {
    assert_eq!(
        ::core::mem::size_of::<emc_table_t>(),
        4928usize,
        concat!("Size of: ", stringify!(emc_table_t))
    );
    assert_eq!(
        ::core::mem::align_of::<emc_table_t>(),
        4usize,
        concat!("Alignment of ", stringify!(emc_table_t))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<emc_table_t>())).rev as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(emc_table_t),
            "::",
            stringify!(rev)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<emc_table_t>())).dvfs_ver as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(emc_table_t),
            "::",
            stringify!(dvfs_ver)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<emc_table_t>())).rate_khz as *const _ as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(emc_table_t),
            "::",
            stringify!(rate_khz)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<emc_table_t>())).min_volt as *const _ as usize },
        68usize,
        concat!(
            "Offset of field: ",
            stringify!(emc_table_t),
            "::",
            stringify!(min_volt)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<emc_table_t>())).gpu_min_volt as *const _ as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(emc_table_t),
            "::",
            stringify!(gpu_min_volt)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<emc_table_t>())).clock_src as *const _ as usize },
        76usize,
        concat!(
            "Offset of field: ",
            stringify!(emc_table_t),
            "::",
            stringify!(clock_src)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<emc_table_t>())).clk_src_emc as *const _ as usize },
        108usize,
        concat!(
            "Offset of field: ",
            stringify!(emc_table_t),
            "::",
            stringify!(clk_src_emc)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<emc_table_t>())).needs_training as *const _ as usize },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(emc_table_t),
            "::",
            stringify!(needs_training)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<emc_table_t>())).training_pattern as *const _ as usize },
        116usize,
        concat!(
            "Offset of field: ",
            stringify!(emc_table_t),
            "::",
            stringify!(training_pattern)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<emc_table_t>())).trained as *const _ as usize },
        120usize,
        concat!(
            "Offset of field: ",
            stringify!(emc_table_t),
            "::",
            stringify!(trained)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<emc_table_t>())).periodic_training as *const _ as usize },
        124usize,
        concat!(
            "Offset of field: ",
            stringify!(emc_table_t),
            "::",
            stringify!(periodic_training)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<emc_table_t>())).trained_dram_clktree_c0d0u0 as *const _
                as usize
        },
        128usize,
        concat!(
            "Offset of field: ",
            stringify!(emc_table_t),
            "::",
            stringify!(trained_dram_clktree_c0d0u0)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<emc_table_t>())).trained_dram_clktree_c0d0u1 as *const _
                as usize
        },
        132usize,
        concat!(
            "Offset of field: ",
            stringify!(emc_table_t),
            "::",
            stringify!(trained_dram_clktree_c0d0u1)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<emc_table_t>())).trained_dram_clktree_c0d1u0 as *const _
                as usize
        },
        136usize,
        concat!(
            "Offset of field: ",
            stringify!(emc_table_t),
            "::",
            stringify!(trained_dram_clktree_c0d1u0)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<emc_table_t>())).trained_dram_clktree_c0d1u1 as *const _
                as usize
        },
        140usize,
        concat!(
            "Offset of field: ",
            stringify!(emc_table_t),
            "::",
            stringify!(trained_dram_clktree_c0d1u1)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<emc_table_t>())).trained_dram_clktree_c1d0u0 as *const _
                as usize
        },
        144usize,
        concat!(
            "Offset of field: ",
            stringify!(emc_table_t),
            "::",
            stringify!(trained_dram_clktree_c1d0u0)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<emc_table_t>())).trained_dram_clktree_c1d0u1 as *const _
                as usize
        },
        148usize,
        concat!(
            "Offset of field: ",
            stringify!(emc_table_t),
            "::",
            stringify!(trained_dram_clktree_c1d0u1)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<emc_table_t>())).trained_dram_clktree_c1d1u0 as *const _
                as usize
        },
        152usize,
        concat!(
            "Offset of field: ",
            stringify!(emc_table_t),
            "::",
            stringify!(trained_dram_clktree_c1d1u0)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<emc_table_t>())).trained_dram_clktree_c1d1u1 as *const _
                as usize
        },
        156usize,
        concat!(
            "Offset of field: ",
            stringify!(emc_table_t),
            "::",
            stringify!(trained_dram_clktree_c1d1u1)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<emc_table_t>())).current_dram_clktree_c0d0u0 as *const _
                as usize
        },
        160usize,
        concat!(
            "Offset of field: ",
            stringify!(emc_table_t),
            "::",
            stringify!(current_dram_clktree_c0d0u0)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<emc_table_t>())).current_dram_clktree_c0d0u1 as *const _
                as usize
        },
        164usize,
        concat!(
            "Offset of field: ",
            stringify!(emc_table_t),
            "::",
            stringify!(current_dram_clktree_c0d0u1)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<emc_table_t>())).current_dram_clktree_c0d1u0 as *const _
                as usize
        },
        168usize,
        concat!(
            "Offset of field: ",
            stringify!(emc_table_t),
            "::",
            stringify!(current_dram_clktree_c0d1u0)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<emc_table_t>())).current_dram_clktree_c0d1u1 as *const _
                as usize
        },
        172usize,
        concat!(
            "Offset of field: ",
            stringify!(emc_table_t),
            "::",
            stringify!(current_dram_clktree_c0d1u1)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<emc_table_t>())).current_dram_clktree_c1d0u0 as *const _
                as usize
        },
        176usize,
        concat!(
            "Offset of field: ",
            stringify!(emc_table_t),
            "::",
            stringify!(current_dram_clktree_c1d0u0)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<emc_table_t>())).current_dram_clktree_c1d0u1 as *const _
                as usize
        },
        180usize,
        concat!(
            "Offset of field: ",
            stringify!(emc_table_t),
            "::",
            stringify!(current_dram_clktree_c1d0u1)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<emc_table_t>())).current_dram_clktree_c1d1u0 as *const _
                as usize
        },
        184usize,
        concat!(
            "Offset of field: ",
            stringify!(emc_table_t),
            "::",
            stringify!(current_dram_clktree_c1d1u0)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<emc_table_t>())).current_dram_clktree_c1d1u1 as *const _
                as usize
        },
        188usize,
        concat!(
            "Offset of field: ",
            stringify!(emc_table_t),
            "::",
            stringify!(current_dram_clktree_c1d1u1)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<emc_table_t>())).run_clocks as *const _ as usize },
        192usize,
        concat!(
            "Offset of field: ",
            stringify!(emc_table_t),
            "::",
            stringify!(run_clocks)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<emc_table_t>())).tree_margin as *const _ as usize },
        196usize,
        concat!(
            "Offset of field: ",
            stringify!(emc_table_t),
            "::",
            stringify!(tree_margin)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<emc_table_t>())).num_burst as *const _ as usize },
        200usize,
        concat!(
            "Offset of field: ",
            stringify!(emc_table_t),
            "::",
            stringify!(num_burst)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<emc_table_t>())).num_burst_per_ch as *const _ as usize },
        204usize,
        concat!(
            "Offset of field: ",
            stringify!(emc_table_t),
            "::",
            stringify!(num_burst_per_ch)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<emc_table_t>())).num_trim as *const _ as usize },
        208usize,
        concat!(
            "Offset of field: ",
            stringify!(emc_table_t),
            "::",
            stringify!(num_trim)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<emc_table_t>())).num_trim_per_ch as *const _ as usize },
        212usize,
        concat!(
            "Offset of field: ",
            stringify!(emc_table_t),
            "::",
            stringify!(num_trim_per_ch)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<emc_table_t>())).num_mc_regs as *const _ as usize },
        216usize,
        concat!(
            "Offset of field: ",
            stringify!(emc_table_t),
            "::",
            stringify!(num_mc_regs)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<emc_table_t>())).num_up_down as *const _ as usize },
        220usize,
        concat!(
            "Offset of field: ",
            stringify!(emc_table_t),
            "::",
            stringify!(num_up_down)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<emc_table_t>())).vref_num as *const _ as usize },
        224usize,
        concat!(
            "Offset of field: ",
            stringify!(emc_table_t),
            "::",
            stringify!(vref_num)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<emc_table_t>())).training_mod_num as *const _ as usize },
        228usize,
        concat!(
            "Offset of field: ",
            stringify!(emc_table_t),
            "::",
            stringify!(training_mod_num)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<emc_table_t>())).dram_timing_num as *const _ as usize },
        232usize,
        concat!(
            "Offset of field: ",
            stringify!(emc_table_t),
            "::",
            stringify!(dram_timing_num)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<emc_table_t>())).ptfv_list as *const _ as usize },
        236usize,
        concat!(
            "Offset of field: ",
            stringify!(emc_table_t),
            "::",
            stringify!(ptfv_list)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<emc_table_t>())).burst_regs as *const _ as usize },
        284usize,
        concat!(
            "Offset of field: ",
            stringify!(emc_table_t),
            "::",
            stringify!(burst_regs)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<emc_table_t>())).burst_reg_per_ch as *const _ as usize },
        1168usize,
        concat!(
            "Offset of field: ",
            stringify!(emc_table_t),
            "::",
            stringify!(burst_reg_per_ch)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<emc_table_t>())).shadow_regs_ca_train as *const _ as usize
        },
        1200usize,
        concat!(
            "Offset of field: ",
            stringify!(emc_table_t),
            "::",
            stringify!(shadow_regs_ca_train)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<emc_table_t>())).shadow_regs_quse_train as *const _ as usize
        },
        2084usize,
        concat!(
            "Offset of field: ",
            stringify!(emc_table_t),
            "::",
            stringify!(shadow_regs_quse_train)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<emc_table_t>())).shadow_regs_rdwr_train as *const _ as usize
        },
        2968usize,
        concat!(
            "Offset of field: ",
            stringify!(emc_table_t),
            "::",
            stringify!(shadow_regs_rdwr_train)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<emc_table_t>())).trim_regs as *const _ as usize },
        3852usize,
        concat!(
            "Offset of field: ",
            stringify!(emc_table_t),
            "::",
            stringify!(trim_regs)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<emc_table_t>())).trim_perch_regs as *const _ as usize },
        4404usize,
        concat!(
            "Offset of field: ",
            stringify!(emc_table_t),
            "::",
            stringify!(trim_perch_regs)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<emc_table_t>())).vref_perch_regs as *const _ as usize },
        4444usize,
        concat!(
            "Offset of field: ",
            stringify!(emc_table_t),
            "::",
            stringify!(vref_perch_regs)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<emc_table_t>())).dram_timings as *const _ as usize },
        4460usize,
        concat!(
            "Offset of field: ",
            stringify!(emc_table_t),
            "::",
            stringify!(dram_timings)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<emc_table_t>())).training_mod_regs as *const _ as usize },
        4480usize,
        concat!(
            "Offset of field: ",
            stringify!(emc_table_t),
            "::",
            stringify!(training_mod_regs)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<emc_table_t>())).save_restore_mod_regs as *const _ as usize
        },
        4560usize,
        concat!(
            "Offset of field: ",
            stringify!(emc_table_t),
            "::",
            stringify!(save_restore_mod_regs)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<emc_table_t>())).burst_mc_regs as *const _ as usize },
        4608usize,
        concat!(
            "Offset of field: ",
            stringify!(emc_table_t),
            "::",
            stringify!(burst_mc_regs)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<emc_table_t>())).la_scale_regs as *const _ as usize },
        4740usize,
        concat!(
            "Offset of field: ",
            stringify!(emc_table_t),
            "::",
            stringify!(la_scale_regs)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<emc_table_t>())).min_mrs_wait as *const _ as usize },
        4836usize,
        concat!(
            "Offset of field: ",
            stringify!(emc_table_t),
            "::",
            stringify!(min_mrs_wait)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<emc_table_t>())).emc_mrw as *const _ as usize },
        4840usize,
        concat!(
            "Offset of field: ",
            stringify!(emc_table_t),
            "::",
            stringify!(emc_mrw)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<emc_table_t>())).emc_mrw2 as *const _ as usize },
        4844usize,
        concat!(
            "Offset of field: ",
            stringify!(emc_table_t),
            "::",
            stringify!(emc_mrw2)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<emc_table_t>())).emc_mrw3 as *const _ as usize },
        4848usize,
        concat!(
            "Offset of field: ",
            stringify!(emc_table_t),
            "::",
            stringify!(emc_mrw3)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<emc_table_t>())).emc_mrw4 as *const _ as usize },
        4852usize,
        concat!(
            "Offset of field: ",
            stringify!(emc_table_t),
            "::",
            stringify!(emc_mrw4)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<emc_table_t>())).emc_mrw9 as *const _ as usize },
        4856usize,
        concat!(
            "Offset of field: ",
            stringify!(emc_table_t),
            "::",
            stringify!(emc_mrw9)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<emc_table_t>())).emc_mrs as *const _ as usize },
        4860usize,
        concat!(
            "Offset of field: ",
            stringify!(emc_table_t),
            "::",
            stringify!(emc_mrs)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<emc_table_t>())).emc_emrs as *const _ as usize },
        4864usize,
        concat!(
            "Offset of field: ",
            stringify!(emc_table_t),
            "::",
            stringify!(emc_emrs)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<emc_table_t>())).emc_emrs2 as *const _ as usize },
        4868usize,
        concat!(
            "Offset of field: ",
            stringify!(emc_table_t),
            "::",
            stringify!(emc_emrs2)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<emc_table_t>())).emc_auto_cal_config as *const _ as usize
        },
        4872usize,
        concat!(
            "Offset of field: ",
            stringify!(emc_table_t),
            "::",
            stringify!(emc_auto_cal_config)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<emc_table_t>())).emc_auto_cal_config2 as *const _ as usize
        },
        4876usize,
        concat!(
            "Offset of field: ",
            stringify!(emc_table_t),
            "::",
            stringify!(emc_auto_cal_config2)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<emc_table_t>())).emc_auto_cal_config3 as *const _ as usize
        },
        4880usize,
        concat!(
            "Offset of field: ",
            stringify!(emc_table_t),
            "::",
            stringify!(emc_auto_cal_config3)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<emc_table_t>())).emc_auto_cal_config4 as *const _ as usize
        },
        4884usize,
        concat!(
            "Offset of field: ",
            stringify!(emc_table_t),
            "::",
            stringify!(emc_auto_cal_config4)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<emc_table_t>())).emc_auto_cal_config5 as *const _ as usize
        },
        4888usize,
        concat!(
            "Offset of field: ",
            stringify!(emc_table_t),
            "::",
            stringify!(emc_auto_cal_config5)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<emc_table_t>())).emc_auto_cal_config6 as *const _ as usize
        },
        4892usize,
        concat!(
            "Offset of field: ",
            stringify!(emc_table_t),
            "::",
            stringify!(emc_auto_cal_config6)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<emc_table_t>())).emc_auto_cal_config7 as *const _ as usize
        },
        4896usize,
        concat!(
            "Offset of field: ",
            stringify!(emc_table_t),
            "::",
            stringify!(emc_auto_cal_config7)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<emc_table_t>())).emc_auto_cal_config8 as *const _ as usize
        },
        4900usize,
        concat!(
            "Offset of field: ",
            stringify!(emc_table_t),
            "::",
            stringify!(emc_auto_cal_config8)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<emc_table_t>())).emc_cfg_2 as *const _ as usize },
        4904usize,
        concat!(
            "Offset of field: ",
            stringify!(emc_table_t),
            "::",
            stringify!(emc_cfg_2)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<emc_table_t>())).emc_sel_dpd_ctrl as *const _ as usize },
        4908usize,
        concat!(
            "Offset of field: ",
            stringify!(emc_table_t),
            "::",
            stringify!(emc_sel_dpd_ctrl)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<emc_table_t>())).emc_fdpd_ctrl_cmd_no_ramp as *const _ as usize
        },
        4912usize,
        concat!(
            "Offset of field: ",
            stringify!(emc_table_t),
            "::",
            stringify!(emc_fdpd_ctrl_cmd_no_ramp)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<emc_table_t>())).dll_clk_src as *const _ as usize },
        4916usize,
        concat!(
            "Offset of field: ",
            stringify!(emc_table_t),
            "::",
            stringify!(dll_clk_src)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<emc_table_t>())).clk_out_enb_x_0_clk_enb_emc_dll as *const _
                as usize
        },
        4920usize,
        concat!(
            "Offset of field: ",
            stringify!(emc_table_t),
            "::",
            stringify!(clk_out_enb_x_0_clk_enb_emc_dll)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<emc_table_t>())).latency as *const _ as usize },
        4924usize,
        concat!(
            "Offset of field: ",
            stringify!(emc_table_t),
            "::",
            stringify!(latency)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct mtc_config_t {
    pub rate_to: s32,
    pub rate_from: s32,
    pub mtc_table: *mut emc_table_t,
    pub table_entries: u32_,
    pub current_emc_table: *mut emc_table_t,
    pub train_mode: u32_,
    pub sdram_id: u32_,
    pub prev_temp: u32_,
    pub emc_2X_clk_src_is_pllmb: bool_,
    pub fsp_for_src_freq: bool_,
    pub train_ram_patterns: bool_,
}
#[test]
fn bindgen_test_layout_mtc_config_t() {
    assert_eq!(
        ::core::mem::size_of::<mtc_config_t>(),
        56usize,
        concat!("Size of: ", stringify!(mtc_config_t))
    );
    assert_eq!(
        ::core::mem::align_of::<mtc_config_t>(),
        8usize,
        concat!("Alignment of ", stringify!(mtc_config_t))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<mtc_config_t>())).rate_to as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(mtc_config_t),
            "::",
            stringify!(rate_to)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<mtc_config_t>())).rate_from as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(mtc_config_t),
            "::",
            stringify!(rate_from)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<mtc_config_t>())).mtc_table as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(mtc_config_t),
            "::",
            stringify!(mtc_table)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<mtc_config_t>())).table_entries as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(mtc_config_t),
            "::",
            stringify!(table_entries)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<mtc_config_t>())).current_emc_table as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(mtc_config_t),
            "::",
            stringify!(current_emc_table)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<mtc_config_t>())).train_mode as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(mtc_config_t),
            "::",
            stringify!(train_mode)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<mtc_config_t>())).sdram_id as *const _ as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(mtc_config_t),
            "::",
            stringify!(sdram_id)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<mtc_config_t>())).prev_temp as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(mtc_config_t),
            "::",
            stringify!(prev_temp)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<mtc_config_t>())).emc_2X_clk_src_is_pllmb as *const _ as usize
        },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(mtc_config_t),
            "::",
            stringify!(emc_2X_clk_src_is_pllmb)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<mtc_config_t>())).fsp_for_src_freq as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(mtc_config_t),
            "::",
            stringify!(fsp_for_src_freq)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<mtc_config_t>())).train_ram_patterns as *const _ as usize
        },
        52usize,
        concat!(
            "Offset of field: ",
            stringify!(mtc_config_t),
            "::",
            stringify!(train_ram_patterns)
        )
    );
}
extern "C" {
    pub fn minerva_main(mtc_cfg: *mut mtc_config_t);
}
